Description: Installs the current core Munki tools from Github.
Identifier: com.github.grahampugh.recipes.install.MunkiToolsCore
ParentRecipe: com.github.grahampugh.recipes.pkg.MunkiToolsCore
MinimumVersion: "2.3"

Input:
  NAME: MunkiToolsCore

Process:
  - Processor: Installer
    Arguments:
      pkg_path: "%pkg_path%"
