Description: Downloads the latest version of Adobe's Creative Cloud Desktop App Installer and packages it for installation. Then, uploads to the Jamf Pro Server.
Identifier: com.github.grahampugh.recipes.jss.AdobeCreativeCloud
ParentRecipe: com.github.rtrouton.pkg.AdobeCreativeCloudInstaller
MinimumVersion: "2.3"

Input:
  NAME: Adobe Creative Cloud
  CATEGORY: Applications
  GROUP_NAME: "%NAME%-update-smart"
  GROUP_TEMPLATE: SmartGroup-update-smart-regex.xml
  JSS_INVENTORY_NAME: Creative Cloud.app
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: Policy-install-latest.xml
  SCRIPT: "%NAME%-postinstall.sh"
  SCRIPT_TEMPLATE: "%NAME%-postinstall-ScriptTemplate.xml"
  SELF_SERVICE_DESCRIPTION: Access Adobe apps from the cloud using your federated Adobe ID.
  SELF_SERVICE_ICON: "%NAME%.png"
  TESTING_GROUP_NAME: Testing

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: JSSImporter
    Arguments:
      category: "%CATEGORY%"
      groups:
        - name: "%GROUP_NAME%"
          smart: true
          template_path: "%GROUP_TEMPLATE%"
      jss_inventory_name: "%JSS_INVENTORY_NAME%"
      policy_category: "%POLICY_CATEGORY%"
      policy_template: "%POLICY_TEMPLATE%"
      prod_name: "%NAME%"
      scripts:
        - name: "%SCRIPT%"
          template_path: "%SCRIPT_TEMPLATE%"
      self_service_description: "%SELF_SERVICE_DESCRIPTION%"
      self_service_icon: "%SELF_SERVICE_ICON%"
