<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Element and creates a package. Then, uploads to the Jamf Pro Server.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.jss.Element</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Connect and Remote</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroup-update-smart-regex.xml</string>
		<key>JSS_INVENTORY_NAME</key>
		<string>Element (Riot).app</string>
		<key>NAME</key>
		<string>Element</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_NAME</key>
		<string>Install Latest %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-install-latest.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Element (formerly Riot) is an open source instant messaging client built on the Matrix protocol.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Element.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.pkg.Element</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>jss_inventory_name</key>
				<string>%JSS_INVENTORY_NAME%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
