Description: Downloads the latest version of Riot and creates a package. Then, uploads to the Jamf Pro Server.
Identifier: com.github.grahampugh.recipes.jss.Riot
ParentRecipe: com.github.grahampugh.recipes.pkg.Riot
MinimumVersion: "2.3"

Input:
  NAME: Riot
  CATEGORY: Connect and Remote
  GROUP_NAME: "%NAME%-update-smart"
  GROUP_TEMPLATE: SmartGroup-update-smart-regex.xml
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: Policy-install-latest.xml
  SELF_SERVICE_DESCRIPTION: Riot is an open source instant messaging client built on the Matrix protocol.
  SELF_SERVICE_ICON: Riot.png
  TESTING_GROUP_NAME: Testing

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: JSSImporter
    Arguments:
      category: "%CATEGORY%"
      groups:
        - name: "%GROUP_NAME%"
          smart: true
          template_path: "%GROUP_TEMPLATE%"
      policy_category: "%POLICY_CATEGORY%"
      policy_template: "%POLICY_TEMPLATE%"
      prod_name: "%NAME%"
      self_service_description: "%SELF_SERVICE_DESCRIPTION%"
      self_service_icon: "%SELF_SERVICE_ICON%"
