<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%PROD_NAME%</name>
        <enabled>true</enabled>
        <frequency>Ongoing</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <!--Scope added by JSSImporter-->
    </scope>
    <package_configuration>
        <!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
        <!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>%SELF_SERVICE_INSTALL_BUTTON%</install_button_text>
        <reinstall_button_text>%SELF_SERVICE_REINSTALL_BUTTON%</reinstall_button_text>
        <self_service_display_name>%PROD_NAME%</self_service_display_name>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <files_processes>
        <run_command>%RUN_COMMAND%</run_command>
    </files_processes>
</policy>
