Description: Downloads the latest Citrix Workspace disk image.
Identifier: com.github.grahampugh.recipes.download.CitrixWorkspace
Input:
  NAME: Citrix Workspace
MinimumVersion: 0.3.1
Process:
- Arguments:
    re_pattern: (?P<DYNAMIC_URL>//downloads.citrix.com/[\d]+/CitrixWorkspaceApp\.dmg\?__gda__\=[\w]+)
    url: https://www.citrix.com/downloads/workspace-app/mac/workspace-app-for-mac-latest.html
  Processor: URLTextSearcher
- Arguments:
    filename: '%NAME%.dmg'
    url: https:%DYNAMIC_URL%
  Processor: URLDownloader
- Processor: EndOfCheckPhase
- Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Citrix Systems, Inc. (S272Y5R93J)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%/Install Citrix Workspace.pkg'
  Processor: CodeSignatureVerifier
