Description: Downloads the latest Citrix Workspace version and extracts the package.
Identifier: com.github.grahampugh.recipes.pkg.CitrixWorkspace
ParentRecipe: io.github.hjuutilainen.download.CitrixWorkspace
MinimumVersion: "2.3"

Input:
  NAME: Citrix Workspace

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%/*.pkg"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/com.citrix.ICAClient.pkg/Payload"

  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack2"
      flat_pkg_path: "%RECIPE_CACHE_DIR%/payload/Library/Application Support/CitrixPackage/com.citrix.apps.cwa.pkg"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/payload2"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack2/com.citrix.ICAClientcwa.pkg/Payload"

  - Processor: Versioner
    Comment: Get version from the pkg
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/payload2/Applications/Citrix Workspace.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%/*.pkg"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/payload"
        - "%RECIPE_CACHE_DIR%/unpack2"
        - "%RECIPE_CACHE_DIR%/payload2"
