Description: Downloads a specific FileMaker Pro Advanced updater zip file.
Identifier: com.github.grahampugh.recipes.download.filemakerproadvanced

Input:
  NAME: FileMaker Pro Advanced
  DOWNLOAD_VERSION: "18.0.3.317"

Process:
  - Processor: URLDownloader
    Arguments:
      url: https://fmdl.filemaker.com/UPDT/18/fmpa_updater_%DOWNLOAD_VERSION%.zip
