Description: Downloads latest FileMaker Pro Advanced updater disk image and extracts the package from within.
Identifier: com.github.grahampugh.recipes.download.filemakerproadvanced

Input:
  NAME: FileMaker Pro Advanced
  MAJOR_VERSION: "18"

Process:
  - Processor: FilemakerProAdvancedUpdateURLProcessor
    Arguments:
      major_version: "%MAJOR_VERSION%"

  - Processor: URLDownloader
    Arguments:
      url: https://fmdl.filemaker.com/esd/fmpa_%version%.dmg
