Description: |
  Downloads latest version of the HP Printer Drivers from Apple and extracts the package from the dmg.
  Note: This recipe suppresses unnecessary copying of the package using the "StopProcessingIf" processor. This means that any recipe that uses this as a parent recipe could stop execution before reaching the child. You may need to remove the cache for the recipe in question and start again if you manually delete or move the package that this recipe creates.
Identifier: com.github.grahampugh.pkg.AppleHPPrinterDrivers
ParentRecipe: com.github.n8felton.download.AppleHPPrinterDrivers

Input:
  NAME: HPPrinterDrivers
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%.pkg'
    overwrite: true
    source_path: '%pathname%/*.pkg'
