Description: |
  Downloads latest version of the HP Printer Drivers from Apple and extracts the package from the dmg.
Identifier: com.github.grahampugh.pkg.AppleHPPrinterDrivers
ParentRecipe: com.github.n8felton.download.AppleHPPrinterDrivers

Input:
  NAME: HPPrinterDrivers

Process:
  - Processor: Copier
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%.pkg"
      overwrite: true
      source_path: "%pathname%/*.pkg"
