<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of AdoptOpenJDK 8. This is based from the tar version rather than the signed pkg version, so that the true version number can be obtained.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.download.AdoptOpenJDK8</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdoptOpenJDK 8</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>^OpenJDK8U-jdk_x64_mac_openj9_.*?.tar.gz$</string>
				<key>github_repo</key>
				<string>AdoptOpenJDK/openjdk8-binaries</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
