<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of AdoptOpenJDK 8. This is based from the tar version rather 
than the signed pkg version, so that the true version number can be obtained.

The default JVM implementation is "hotspot". To override to "openj9", change the value of JVM_IMPLEMENTATION.

The default Release Type is "releases", which is the stable build. To get the most recent build, select "nightly".
</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.download.AdoptOpenJDK8</string>
	<key>Input</key>
	<dict>
		<key>JVM_IMPLEMENTATION</key>
		<string>hotspot</string>
		<key>NAME</key>
		<string>AdoptOpenJDK 8</string>
		<key>RELEASE_STREAM</key>
		<string>releases</string>
		<key>STOPPROCESSINGIF_PREDICATE</key>
		<string>download_changed == False</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>binary_link.*?(?P&lt;match&gt;AdoptOpenJDK.*?\/OpenJDK8U-jdk_x64_mac_%JVM_IMPLEMENTATION%_.*?\.tar\.gz)</string>
				<key>url</key>
				<string>https://api.adoptopenjdk.net/v2/latestAssets/%RELEASE_STREAM%/openjdk8?os=mac&amp;arch=x64&amp;heap_size=normal&amp;openjdk_impl=%JVM_IMPLEMENTATION%&amp;type=jdk</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%STOPPROCESSINGIF_PREDICATE%</string>
			</dict>
			<key>Comment</key>
			<string>Checks if the file already exists in the cache</string>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
	</array>
</dict>
</plist>
