Description: Downloads the latest EndNote updates, unzips the contents, and creates a custom package that will install the EndNote update onto the system.
Identifier: com.github.grahampugh.recipes.pkg.EndNoteUpdates
ParentRecipe: com.github.grahampugh.recipes.download.EndNoteUpdates

Input:
  NAME: EndNote
  MAJOR_VERSION: X9
  INT_VERSION: '19'

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/Scripts'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/Scripts/EndNoteUpdater.app'
    source_path: '%RECIPE_CACHE_DIR%/%NAME%-%MAJOR_VERSION%/*/*.app'

- Processor: FileCreator
  Arguments:
    file_content: "#!/usr/bin/python\n\nimport os\nimport os.path\nimport shutil\n\n# Check if EndNote Cite While You Write is already installed\nendnote_bundle_2008 = os.path.exists(\"/Applications/Microsoft Office 2008/Office/Startup/Word/EndNote CWYW Word 2008.bundle\")\nendnote_bundle_2011 = os.path.exists(\"/Applications/Microsoft Office 2011/Office/Startup/Word/EndNote CWYW Word 2011.bundle\")\nendnote_bundle_2016 = os.path.exists(\"/Library/Application Support/Microsoft/Office365/User Content.localized/Startup.localized/Word/EndNote CWYW Word 2016.bundle\")\n\n\ndef check_endnote_2008():\n    # If the CWYW bundle is installed for Office 2008, then remove it\n    if endnote_bundle_2008:\n        print \"EndNote bundle is installed for Office 2008\"\n        shutil.rmtree(\"/Applications/Microsoft Office 2008/Office/Startup/Word/EndNote CWYW Word 2008.bundle\")\n        print \"Removed the CWYW bundle from 2011\"\n    else:\n        print \"EndNote bundle is not installed for Office 2008\"\n        print \"Checking Office 2011 now\"\n\ndef check_endnote_2011():\n    # If the CWYW bundle is installed for Office 2011, then remove it\n    if endnote_bundle_2011:\n        print \"EndNote bundle is installed for Office 2011\"\n        shutil.rmtree(\"/Applications/Microsoft Office 2011/Office/Startup/Word/EndNote CWYW Word 2011.bundle\")\n        print \"Removed the CWYW bundle from 2011\"\n    else:\n        print \"EndNote bundle is not installed for Office 2011\"\n        print \"Proceeding with installation\"\n\ndef check_endnote_2016():\n    # If the CWYW bundle is installed for Office 2016, then remove it\n    if endnote_bundle_2016:\n        print \"EndNote bundle is installed for Office 2016\"\n        shutil.rmtree(\"/Library/Application Support/Microsoft/Office365/User Content.localized/Startup.localized/Word/EndNote CWYW Word 2016.bundle\")\n        print \"Removed the CWYW bundle from 2016\"\n    else:\n        print \"EndNote bundle is not installed for Office 2016\"\n        print \"Proceeding with installation\"\n\ndef main():\n    check_endnote_2008()\n    check_endnote_2011()\n    check_endnote_2016()\n\nmain()\n"
    file_mode: '0755'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/preinstall'

- Processor: FileCreator
  Arguments:
    file_content: "#!/usr/bin/python\n\nimport os\nimport os.path\nimport shutil\nimport subprocess\nimport glob\n\ndef bashCommand(script):\n    try:\n        return subprocess.check_output(script)\n    except (subprocess.CalledProcessError, OSError), err:\n        return \"[* Error] **%s** [%s]\" % (err, str(script))\n\ninstaller_app = \"EndNoteUpdater.app\"\n\ndef applyPatch():\n    bashCommand([\"%s/Contents/Resources/applyPatch\" % installer_app, \"-d\", \"/Applications/EndNote %MAJOR_VERSION%\", \"-i\", \"%s/Contents/Resources/Patchfile.patch\" % installer_app])\n\ndef main():\n    applyPatch()\n\nmain()\n"
    file_mode: '0755'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/postinstall'

- Processor: PkgCreator
  Arguments:
    force_pkg_build: true
    pkg_request:
      id: com.endnote.EndNote%MAJOR_VERSION%
      options: purge_ds_store
      pkgname: '%NAME%%MAJOR_VERSION%-updater-%version%'
      pkgroot: pkgroot
      scripts: Scripts

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/pkgroot'
    - '%RECIPE_CACHE_DIR%/Scripts'
