Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of CotEditor and creates a package.
Identifier: com.github.grahampugh.pkg.CotEditor
ParentRecipe: com.github.grahampugh.download.CotEditor
MinimumVersion: 1.0.0

Input:
  NAME: CotEditor
  BUNDLE_ID: com.coteditor.CotEditor

Process:
- Processor: AppPkgCreator
