Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of CotEditor and imports it into Munki.
Identifier: com.github.grahampugh.munki.CotEditor
Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: CotEditor
  pkginfo:
    catalogs:
    - testing
    description: Lightweight Plain-Text Editor for macOS
    developer: Kosuke USAMI
    display_name: CotEditor
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.download.CotEditor
Process:
- Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
  Processor: MunkiImporter
