Description: Downloads the current version of Dell Display and Peripheral Manager.
Identifier: com.github.grahampugh.recipes.download.DellDisplayAndPeripheralManager
MinimumVersion: "2.3"

Input:
  NAME: Dell Display and Peripheral Manager
  UPDATE_FEED_URL: https://clientperipherals.dell.com/DDPM/Mac/Application/ddpm.json

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '\"pkgUrl\":\s*\"(?P<url>https://clientperipherals\.dell\.com/DDPM/Mac/Application/DDPMv(?P<version>[0-9.]+)\.zip)\"'
      url: "%UPDATE_FEED_URL%"
      request_headers:
        user-agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_4) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.1 Safari/605.1.15

  - Processor: URLDownloader
    Arguments:
      url: "%url%"
      request_headers:
        user-agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_4) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.1 Safari/605.1.15

  - Processor: EndOfCheckPhase

  - Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: True
    Processor: Unarchiver

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unzip/**/DDPM_Installer.pkg"

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%found_filename%"
      expected_authority_names:
        - "Developer ID Installer: Qisda Corp. (76K5J93FY6)"
        - Developer ID Certification Authority
        - Apple Root CA
