Description: Downloads and package the latest LibreOffice with the right language. Set RELEASE to either "fresh" or "still"
Identifier: com.github.grahampugh.recipes.pkg.LibreOfficeLangPack
Input:
  LANGUAGE_CODE: de
  NAME: LibreOffice
  RELEASE: still
  TYPE: mac-x86_64
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.recipes.download.LibreOfficeLangPack
Process:
- Arguments:
    dmg_path: '%pathname_app%'
  Processor: AppDmgVersioner
- Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
  Processor: PkgRootCreator
- Arguments:
    destination_path: '%pkgroot%/Applications/LibreOffice.app'
    source_path: '%pathname_app%/LibreOffice.app'
  Processor: Copier
- Arguments:
    destination_path: '%RECIPE_CACHE_DIR%'
    source_path: '%pathname%/LibreOffice Language Pack.app/Contents/tarball.tar.bz2'
  Processor: Copier
- Arguments:
    archive_path: '%RECIPE_CACHE_DIR%/tarball.tar.bz2'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%.app'
  Processor: Unarchiver
- Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: org.libreoffice.langpack-%LANGUAGE_CODE%
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
    pkgname: '%NAME%_%LANGUAGE_CODE%-%version%'
  Processor: PkgCreator
