Description: Downloads and package the latest LibreOffice with the right language. Set RELEASE to either "fresh" or "still"
Identifier: com.github.grahampugh.recipes.download.LibreOfficeLangPack
ParentRecipe: io.github.hjuutilainen.download.LibreOffice
MinimumVersion: "2.3"

Input:
  NAME: LibreOffice
  LANGUAGE_CODE: de
  RELEASE: still

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: Consider switching to the LibreOfficeLangPack recipes in the wycomco-recipes repo. This recipe is deprecated and will be removed in the future.

  - Processor: com.github.sebtomasi.SharedProcessors/RenameVar
    Arguments:
      input_var: "%pathname%"
      rename_var: pathname_app

  - Processor: com.github.homebysix-recipes.FindAndReplace/FindAndReplace
    Arguments:
      input_string: '%url%'
      find: .dmg
      replace: '_langpack_%LANGUAGE_CODE%.dmg'


  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%_langpack_%LANGUAGE_CODE%.dmg"
      url: "%output_string%"

  - Processor: EndOfCheckPhase
