Description: Downloads and package the latest LibreOffice with the right language. Set RELEASE to either "fresh" or "still"
Identifier: com.github.grahampugh.recipes.download.LibreOfficeLangPack
ParentRecipe: io.github.hjuutilainen.download.LibreOffice
MinimumVersion: "2.3"

Input:
  NAME: LibreOffice
  LANGUAGE_CODE: de
  RELEASE: still

Process:
  - Processor: com.github.sebtomasi.SharedProcessors/RenameVar
    Arguments:
      input_var: "%pathname%"
      rename_var: pathname_app

  - Processor: com.github.sebtomasi.SharedProcessors/TextSubstituer
    Arguments:
      input_string: "%url%"
      pattern_replace:
        - pattern: .dmg
          repl: _langpack_%LANGUAGE_CODE%.dmg

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%_langpack_%LANGUAGE_CODE%.dmg"
      url: "%parsed_string%"

  - Processor: EndOfCheckPhase
