Description: Downloads the latest BasicTeX release and renames the pkg to include the version number.
Identifier: com.github.grahampugh.recipes.pkg.BasicTeX
ParentRecipe: com.github.grahampugh.recipes.download.BasicTeX
MinimumVersion: "2.3"

Input:
  NAME: BasicTeX

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%"
