Description: Downloads the latest BasicTeX release and renames the pkg to include the version number.
Identifier: com.github.grahampugh.recipes.pkg.BasicTeX
MinimumVersion: 0.2.9
ParentRecipe: com.github.grahampugh.recipes.download.BasicTeX
Input:
  NAME: BasicTeX
Process:
- Processor: StopProcessingIf
  Arguments:
    predicate: download_changed == False
- Processor: FlatPkgUnpacker
  Arguments:
    purge_destination: true
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pathname%'
- Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
    source_pkg: '%pathname%'
  Processor: PkgCopier
