Description: Downloads the latest GhostScript release from the MacTeX site and renames the pkg to include the version number.
Identifier: com.github.grahampugh.recipes.pkg.GhostScript
ParentRecipe: com.github.dataJAR-recipes.download.MacTeX Ghostscript
MinimumVersion: "2.3"

Input:
  NAME: GhostScript
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
  - Processor: StopProcessingIf
    Comment: Checks if the file already exists in the cache
    Arguments:
      predicate: "%STOPPROCESSINGIF_PREDICATE%"

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%"
