Description: Downloads the latest GhostScript release from the MacTeX site and renames the pkg to include the version number.
Identifier: com.github.grahampugh.recipes.pkg.GhostScript
Input:
  NAME: GhostScript
MinimumVersion: 0.2.9
ParentRecipe: 'com.github.dataJAR-recipes.download.MacTeX Ghostscript'
Process:
- Arguments:
    predicate: download_changed == False
  Comment: Checks if the file already exists in the cache
  Processor: StopProcessingIf
- Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
    source_pkg: '%pathname%'
  Processor: PkgCopier
