<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of LaTeXiT.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.download.LaTeXiT</string>
	<key>Input</key>
	<dict>
		<key>BASE_URL</key>
		<string>https://pierre.chachatelier.fr/latexit/</string>
		<key>NAME</key>
		<string>LaTeXiT</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;url&gt;downloads/LaTeXiT-(?P&lt;version_ul&gt;[\d_]+).dmg)</string>
		<key>SEARCH_URL</key>
		<string>%BASE_URL%/latexit-downloads.php?lang=en</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%SEARCH_PATTERN%</string>
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_5) AppleWebKit/600.8.9 (KHTML, like Gecko) Version/8.0.8 Safari/600.8.9</string>
				</dict>
				<key>url</key>
				<string>%SEARCH_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version_ul%.dmg</string>
				<key>url</key>
				<string>%BASE_URL%/%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
