Description: Downloads the latest version of LaTeXiT.
Identifier: com.github.grahampugh.recipes.download.LaTeXiT
MinimumVersion: "2.3"

Input:
  NAME: LaTeXiT
  BASE_URL: https://pierre.chachatelier.fr/latexit/
  SEARCH_PATTERN: (?P<url>downloads/LaTeXiT-(?P<version_ul>[\d_]+).dmg)
  SEARCH_URL: "%BASE_URL%/latexit-downloads.php?lang=en"

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "%SEARCH_PATTERN%"
      request_headers:
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_5) AppleWebKit/600.8.9 (KHTML, like Gecko) Version/8.0.8 Safari/600.8.9
      url: "%SEARCH_URL%"

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%version_ul%.dmg"
      url: "%BASE_URL%/%url%"

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: EndOfCheckPhase
