Description: Downloads the latest version of LaTeXiT and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.LaTeXiT
ParentRecipe: com.github.grahampugh.recipes.download.LaTeXiT
MinimumVersion: "2.3"

Input:
  NAME: LaTeXiT

Process:
  - Processor: AppPkgCreator
    Arguments:
