Description: Downloads the latest version of LaTeXiT and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.LaTeXiT
Input:
  NAME: LaTeXiT
MinimumVersion: 1.0.0
ParentRecipe: com.github.scriptingosx.download.LaTeXiT
Process:
- Arguments:
    predicate: download_changed == False
  Comment: Checks if the file already exists in the cache
  Processor: StopProcessingIf
- Processor: AppPkgCreator
  Arguments:
    force_pkg_build: true
