Description: Downloads the latest MacTeX release and renames the pkg to include the version number.
Identifier: com.github.grahampugh.pkg.MacTeX
ParentRecipe: com.github.joshua-d-miller.download.MacTeX
MinimumVersion: "2.3"

Input:
  NAME: MacTeX

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%"
