Description: Downloads the latest MacTeX release and renames the pkg to include the version number.
Identifier: com.github.grahampugh.pkg.MacTeX
ParentRecipe: com.github.joshua-d-miller.download.MacTeX
MinimumVersion: "2.3"

Input:
  NAME: MacTeX
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
  - Processor: StopProcessingIf
    Comment: Checks if the file already exists in the cache
    Arguments:
      predicate: "%STOPPROCESSINGIF_PREDICATE%"

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%"
