Description: Downloads the latest TeXLive Utility release and renames the pkg to include the version number.
Identifier: com.github.grahampugh.recipes.pkg.TeXLiveUtility
ParentRecipe: com.github.grahampugh.recipes.download.TeXLiveUtility
MinimumVersion: "2.3"

Input:
  NAME: TeXLive Utility

Process:
  - Processor: AppPkgCreator
    Arguments:
      force_pkg_build: true
