Description: Downloads the latest version of TeX Live Utility and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.TeXLiveUtility
ParentRecipe: com.github.grahampugh.recipes.download.TeXLiveUtility
MinimumVersion: "2.3"

Input:
  NAME: TeXLive Utility

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/%NAME%/TeX Live Utility.app"
