<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest TeXLive Utility release and renames the pkg to include the version number.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.pkg.TeXLiveUtility</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeXLive Utility</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.download.TeXLiveUtility</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip/*.app</string>
				<key>force_pkg_build</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
