Comment: Adapted 
Description: Downloads the latest version of TeX Live Utility.
Identifier: no.norce.download.TeXLiveUtility
MinimumVersion: 1.0.0

Input:
  NAME: TeXLive Utility

Process:
- Processor: SparkleUpdateInfoProvider
  Arguments:
    appcast_url: https://raw.githubusercontent.com/amaxwell/tlutility/master/appcast/tlu_appcast.xml

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.zip'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/TeX Live Utility.app'
    requirement: identifier "com.googlecode.mactlmgr.tlu" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "966Z24PX4J"
