Description: Downloads the current release version of TeXShop and builds a package with TeXShop in /Applications/TeX to match a MacTeX deistribution.
Identifier: com.github.grahampugh.recipes.pkg.TeXShop
Input:
  NAME: TeXShop
MinimumVersion: 0.2.0
ParentRecipe: io.github.hjuutilainen.download.TeXShop
Process:
- Arguments:
    predicate: download_changed == False
  Comment: Checks if the file already exists in the cache
  Processor: StopProcessingIf
- Arguments:
    pkgdirs:
      Applications: '0775'
      'Applications/TeX': '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
  Processor: PkgRootCreator
- Arguments:
    archive_path: '%pathname%'
    destination_path: '%pkgroot%/Applications/TeX'
    purge_destination: true
  Processor: Unarchiver
- Arguments:
    input_plist_path: '%pkgroot%/Applications/TeX/TeXShop.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
  Comment: Get version from the app
  Processor: Versioner
- Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      - group: admin
        path: Applications/TeX
        user: root
      id: edu.uoregon.TeXShop
      options: purge_ds_store
      pkgname: '%NAME%-%version%'
      version: '%version%'
    force_pkg_build: true
  Processor: PkgCreator
