Description: Downloads the current release version of TeXShop and builds a package with TeXShop in /Applications/TeX to match a MacTeX deistribution.
Identifier: com.github.grahampugh.recipes.pkg.TeXShop
ParentRecipe: io.github.hjuutilainen.download.TeXShop
MinimumVersion: "2.3"

Input:
  NAME: TeXShop

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
        Applications/TeX: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%pkgroot%/Applications/TeX"
      purge_destination: true

  - Processor: Versioner
    Comment: Get version from the app
    Arguments:
      input_plist_path: "%pkgroot%/Applications/TeX/TeXShop.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: PkgCreator
    Arguments:
      force_pkg_build: true
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
          - group: admin
            path: Applications/TeX
            user: root
        id: edu.uoregon.TeXShop
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        version: "%version%"
