Description: Downloads latest FileMaker Pro Advanced updater disk image and extracts the package from within.
Identifier: com.github.grahampugh.pkg.filemakerproadvancedupdater
Input:
  NAME: FileMaker Pro Advanced
  major_version: '16'
ParentRecipe: com.github.grahampugh.download.filemakerproadvancedupdater
Process:
- Arguments:
    downloaded_file: '%pathname%'
  Processor: FilemakerProAdvancedUpdateExtractor
- Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/FileMakerProAdvancedUpdater_%version%.pkg'
    source_pkg: '%pkg_path%'
  Processor: PkgCopier
