Description: Downloads the latest Citrix Workspace version and extracts the package.
Identifier: com.github.grahampugh.recipes.pkg.CitrixWorkspace
Input:
  NAME: Citrix Workspace
MinimumVersion: 0.4.0
ParentRecipe: com.github.grahampugh.recipes.download.CitrixWorkspace
Process:
- Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pathname%/*.pkg'
  Processor: FlatPkgUnpacker
- Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/payload'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/com.citrix.ICAClient.pkg/Payload'
  Processor: PkgPayloadUnpacker
- Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/payload/Applications/Citrix Workspace.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
  Comment: Get version from the pkg
  Processor: Versioner
- Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
    source_pkg: '%pathname%/*.pkg'
  Processor: PkgCopier
