Description: This recipe and the associated processor has been deprecated. Please use com.github.bnpl.autopkg.download.intellijideace instead (autopkg/bnpl-recipes).
Identifier: com.github.grahampugh.recipes.download.IntelliJ-IDEA-CE
MinimumVersion: "2.3"

Input: {}

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: This recipe and the associated processor has been deprecated. Please use com.github.bnpl.autopkg.download.intellijideace instead (autopkg/bnpl-recipes).
