Description: Downloads the latest version of dupeGuru and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.IntelliJ-IDEA-CE
ParentRecipe: com.github.grahampugh.recipes.download.IntelliJ-IDEA-CE
MinimumVersion: "2.3"

Input:
  NAME: Intellij IDEA CE

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: AppPkgCreator
    Arguments:
      force_pkg_build: false
      pkg_path: "%RECIPE_CACHE_DIR%/IntelliJ-IDEA-CE-%version%.pkg"
