Description: Downloads the latest version of Riot and creates a package. Note that this recipe has been deprecated, as Riot has been renamed to Element (Riot). Please use the Element recipes instead.
Identifier: com.github.grahampugh.recipes.pkg.Riot
ParentRecipe: com.github.grahampugh.recipes.download.Riot
MinimumVersion: 1.0.0

Input:
  NAME: Riot
  BUNDLE_ID: im.riot.app

Process:
- Processor: DeprecationWarning
  Arguments:
    warning_message: This recipe has been deprecated, as Riot has been renamed to Element (Riot). Please use the Element recipes instead.

- Processor: AppPkgCreator
