Description: Deprecated and no longer functional. Please remove from your recipe lists.
Identifier: com.github.grahampugh.recipes.munki.AdoptOpenJDK13_OpenJ9_Signed
ParentRecipe: com.github.grahampugh.recipes.download.AdoptOpenJDK13_OpenJ9_Signed

Input:
  NAME: AdoptOpenJDK 13 OpenJ9

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: AdoptOpenJDK has been replaced by Eclipse Temurin. Please switch to using an EclipseTemurin recipe from this repo.
