Description: Deprecated and no longer functional. Please remove from your recipe lists.
Identifier: com.github.grahampugh.recipes.munki.AdoptOpenJDK12_Signed
ParentRecipe: com.github.grahampugh.recipes.download.AdoptOpenJDK12_Signed

Input:
  NAME: AdoptOpenJDK 12

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: AdoptOpenJDK has been replaced by Eclipse Temurin. Please switch to using an EclipseTemurin recipe.
