Comment: Recipe automatically generated from com.justinrummel.jss.1Password by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.1Password-pkg-upload
ParentRecipe: io.github.hjuutilainen.pkg.1Password
MinimumVersion: '2.3'

Input:
  NAME: 1Password
  CATEGORY: 1Password

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
