Comment: Recipe automatically generated from com.github.jss-recipes.jss.Aircall by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Aircall-pkg-upload
ParentRecipe: com.github.ahousseini-recipes.pkg.Aircall
MinimumVersion: '2.3'

Input:
  NAME: Aircall
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
