Comment: Recipe automatically generated from com.github.jss-recipes.jss.Alfred2 by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Alfred2-pkg-upload
ParentRecipe: io.github.hjuutilainen.pkg.Alfred2
MinimumVersion: '2.3'

Input:
  NAME: Alfred 2
  CATEGORY: Utility

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
