Comment: Recipe automatically generated from com.github.novaksam.jss.AndroidStudio by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.AndroidStudio-pkg-upload
ParentRecipe: com.github.novaksam.pkg.AndroidStudio
MinimumVersion: '2.3'

Input:
  NAME: Android Studio
  CATEGORY: Utilities

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
