Comment: Recipe automatically generated from io.github.hjuutilainen.pkg.Atom by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Atom-pkg-upload
ParentRecipe: io.github.hjuutilainen.pkg.Atom
MinimumVersion: '2.3'

Input:
  NAME: Atom
  CATEGORY: Applications

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
