Comment: Recipe automatically generated from com.github.jss-recipes.jss.AuroraHDRPro by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.AuroraHDRPro-pkg-upload
ParentRecipe: com.github.homebysix.pkg.AuroraHDRPro
MinimumVersion: '2.3'

Input:
  NAME: Aurora HDR Pro
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
