Comment: Recipe automatically generated from com.github.jss-recipes.jss.AutoMounter by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.AutoMounter-pkg-upload
ParentRecipe: com.github.ahousseini-recipes.pkg.AutoMounter
MinimumVersion: '2.3'

Input:
  NAME: AutoMounter
  CATEGORY: Utility

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
