Comment: Recipe automatically generated from com.github.jss-recipes.jss.Bartender by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Bartender-pkg-upload
ParentRecipe: com.github.homebysix.pkg.Bartender
MinimumVersion: '2.3'

Input:
  NAME: Bartender
  CATEGORY: Utility

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
