Comment: Recipe automatically generated from com.github.jss-recipes.jss.BBEdit by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.BBEdit-pkg-upload
ParentRecipe: com.github.autopkg.pkg.BBEdit
MinimumVersion: '2.3'

Input:
  NAME: BBEdit
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
