Comment: Recipe automatically generated from com.github.jss-recipes.jss.BibDesk by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.BibDesk-pkg-upload
ParentRecipe: io.github.hjuutilainen.pkg.BibDesk
MinimumVersion: '2.3'

Input:
  NAME: BibDesk
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
