Comment: Recipe automatically generated from com.github.jss-recipes.jss.Blender by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Blender-pkg-upload
ParentRecipe: io.github.hjuutilainen.pkg.Blender
MinimumVersion: '2.3'

Input:
  NAME: Blender
  CATEGORY: Digital Media

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
