Comment: Recipe automatically generated from com.github.jss-recipes.jss.BoxSync by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.BoxSync-pkg-upload
ParentRecipe: com.github.hansen-m.pkg.boxsync
MinimumVersion: '2.3'

Input:
  NAME: Box Sync
  CATEGORY: Utility

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
