Comment: Recipe automatically generated from com.github.novaksam.jss.Brackets by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Brackets-pkg-upload
ParentRecipe: com.github.novaksam.pkg.Brackets
MinimumVersion: '2.3'

Input:
  NAME: Brackets
  CATEGORY: Utilities

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
