Comment: Recipe automatically generated from com.github.jss-recipes.jss.Cakebrew by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Cakebrew-pkg-upload
ParentRecipe: com.github.homebysix.pkg.Cakebrew
MinimumVersion: '2.3'

Input:
  NAME: Cakebrew
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
