Comment: Recipe automatically generated from com.github.jss-recipes.jss.Celestia by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Celestia-pkg-upload
ParentRecipe: com.github.homebysix.pkg.Celestia
MinimumVersion: '2.3'

Input:
  NAME: Celestia
  CATEGORY: Science and Math

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
