Comment: Recipe automatically generated from com.github.jss-recipes.jss.CheatSheet by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.CheatSheet-pkg-upload
ParentRecipe: io.github.hjuutilainen.pkg.CheatSheet
MinimumVersion: '2.3'

Input:
  NAME: CheatSheet
  CATEGORY: Utility

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
