Comment: Recipe automatically generated from com.github.jss-recipes.jss.Coda2 by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Coda2-pkg-upload
ParentRecipe: com.github.autopkg.pkg.coda2
MinimumVersion: '2.3'

Input:
  NAME: Coda 2
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
