Comment: Recipe automatically generated from com.github.jss-recipes.jss.Colloquy by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Colloquy-pkg-upload
ParentRecipe: io.github.hjuutilainen.pkg.Colloquy
MinimumVersion: '2.3'

Input:
  NAME: Colloquy
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
