Comment: Recipe automatically generated from com.github.jss-recipes.jss.CoRD by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.CoRD-pkg-upload
ParentRecipe: io.github.hjuutilainen.pkg.CoRD
MinimumVersion: '2.3'

Input:
  NAME: CoRD
  CATEGORY: Utility

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
