Comment: Recipe automatically generated from com.github.rtrouton.jss.Cyberduck by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Cyberduck-pkg-upload
ParentRecipe: com.github.rtrouton.pkg.Cyberduck
MinimumVersion: '2.3'

Input:
  NAME: Cyberduck
  CATEGORY: Internet Utilities

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
