Comment: Recipe automatically generated from com.github.jss-recipes.jss.DaisyDisk by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.DaisyDisk-pkg-upload
ParentRecipe: io.github.hjuutilainen.pkg.DaisyDisk
MinimumVersion: '2.3'

Input:
  NAME: DaisyDisk
  CATEGORY: Utility

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
