Comment: Recipe automatically generated from com.github.rtrouton.jss.dropbox by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Dropbox-pkg-upload
ParentRecipe: com.github.autopkg.pkg.dropbox
MinimumVersion: '2.3'

Input:
  NAME: Dropbox
  CATEGORY: Dropbox

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
