Comment: Recipe automatically generated from com.github.jss-recipes.jss.Eclipse-Luna by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Eclipse-pkg-upload
ParentRecipe: com.github.homebysix.pkg.EclipseLuna
MinimumVersion: '2.3'

Input:
  NAME: Eclipse
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
