<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Options for INSTALLER are - erase-install, erase-install-nopython, erase-install-depnotify</string>
	<key>Description</key>
	<string>Downloads the latest version of erase-install and uploads the package to Jamf.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.jamf.erase-install-pkg-upload</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Administration</string>
		<key>INSTALLER</key>
		<string>erase-install-depnotify</string>
		<key>NAME</key>
		<string>erase-install</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.pkg.erase-install</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
	</array>
</dict>
</plist>
