Comment: Recipe automatically generated from com.github.jss-recipes.jss.Espresso by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Espresso-pkg-upload
ParentRecipe: com.github.homebysix.pkg.Espresso
MinimumVersion: '2.3'

Input:
  NAME: Espresso
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
