Comment: Recipe automatically generated from com.github.novaksam.jss.Evernote by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Evernote-pkg-upload
ParentRecipe: com.github.autopkg.pkg.Evernote
MinimumVersion: '2.3'

Input:
  NAME: Evernote
  CATEGORY: Media

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
