Comment: Recipe automatically generated from com.github.rtrouton.jss.Firefox by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Firefox-pkg-upload
ParentRecipe: com.github.rtrouton.pkg.Firefox
MinimumVersion: '2.3'

Input:
  NAME: Firefox
  CATEGORY: Web Browsers and Internet Utilities

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
