Comment: Recipe automatically generated from com.github.jss-recipes.jss.FontFinagler by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.FontFinagler-pkg-upload
ParentRecipe: com.github.homebysix.pkg.FontFinagler
MinimumVersion: '2.3'

Input:
  NAME: Font Finagler
  CATEGORY: Utility

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
