Comment: Recipe automatically generated from com.github.jss-recipes.jss.Gephi by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Gephi-pkg-upload
ParentRecipe: com.github.joshua-d-miller.pkg.gephi
MinimumVersion: '2.3'

Input:
  NAME: Gephi
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
