Comment: Recipe automatically generated from com.github.jss-recipes.jss.GitHubDesktop by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.GitHubDesktop-pkg-upload
ParentRecipe: com.github.homebysix.pkg.GitHubDesktop
MinimumVersion: '2.3'

Input:
  NAME: GitHub Desktop
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
