Comment: Recipe automatically generated from com.github.novaksam.jss.GoogleChrome by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.GoogleChrome-pkg-upload
ParentRecipe: com.github.autopkg.pkg.googlechrome
MinimumVersion: '2.3'

Input:
  NAME: Google Chrome
  CATEGORY: Browsers

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
