Comment: Recipe automatically generated from com.github.jss-recipes.jss.GoogleEarth by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.GoogleEarth-pkg-upload
ParentRecipe: com.github.autopkg.pkg.google-earth
MinimumVersion: '2.3'

Input:
  NAME: Google Earth
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
