Comment: Recipe automatically generated from com.github.jss-recipes.jss.GoogleEarthPro by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.GoogleEarthPro-pkg-upload
ParentRecipe: com.github.autopkg.nmcspadden-recipes.pkg.google-earth-pro
MinimumVersion: '2.3'

Input:
  NAME: Google Earth Pro
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
