Comment: Recipe automatically generated from com.github.jss-recipes.jss.GoogleVoiceandVideo by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.GoogleVoiceandVideo-pkg-upload
ParentRecipe: com.github.hansen-m.pkg.GoogleVoiceAndVideo
MinimumVersion: '2.3'

Input:
  NAME: Google Voice and Video
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
