Comment: Recipe automatically generated from com.github.jss-recipes.jss.Grammarly by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Grammarly-pkg-upload
ParentRecipe: com.github.homebysix.pkg.Grammarly
MinimumVersion: '2.3'

Input:
  NAME: Grammarly
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
