Comment: Recipe automatically generated from com.github.jss-recipes.jss.GSP5 by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.GSP5-pkg-upload
ParentRecipe: com.github.homebysix.pkg.GSP5
MinimumVersion: '2.3'

Input:
  NAME: GSP5
  CATEGORY: Science and Math

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
