Comment: Recipe automatically generated from com.github.jss-recipes.jss.HandBrake by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.HandBrake-pkg-upload
ParentRecipe: com.github.autopkg.pkg.Handbrake
MinimumVersion: '2.3'

Input:
  NAME: HandBrake
  CATEGORY: Digital Media

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
