Comment: Recipe automatically generated from com.github.novaksam.jss.iMovie by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.iMovie-pkg-upload
ParentRecipe: com.github.nmcspadden.pkg.appstore
MinimumVersion: '2.3'

Input:
  NAME: iMovie
  CATEGORY: Media

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
