Comment: Recipe automatically generated from com.github.jss-recipes.jss.Inkscape by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Inkscape-pkg-upload
ParentRecipe: com.github.homebysix.pkg.Inkscape
MinimumVersion: '2.3'

Input:
  NAME: Inkscape
  CATEGORY: Digital Media

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
