Comment: Recipe automatically generated from com.github.jss-recipes.jss.Kaleidoscope by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Kaleidoscope-pkg-upload
ParentRecipe: io.github.hjuutilainen.pkg.Kaleidoscope
MinimumVersion: '2.3'

Input:
  NAME: Kaleidoscope
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
