Comment: Recipe automatically generated from com.github.jss-recipes.jss.Mailplane3 by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Mailplane3-pkg-upload
ParentRecipe: com.github.homebysix.pkg.Mailplane3
MinimumVersion: '2.3'

Input:
  NAME: Mailplane 3
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
