Comment: Recipe automatically generated from com.github.jss-recipes.jss.MicrosoftPowerPoint by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.MicrosoftPowerPoint-pkg-upload
ParentRecipe: com.github.jss-recipes.jss.MicrosoftPowerPoint
MinimumVersion: '2.3'

Input:
  NAME: Microsoft PowerPoint
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
