Comment: Recipe automatically generated from com.github.jss-recipes.jss.MicrosoftWord by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.MicrosoftWord-pkg-upload
ParentRecipe: com.github.jss-recipes.jss.MicrosoftWord
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Word
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
