Comment: Recipe automatically generated from com.github.jss-recipes.jss.MicrosoftExcel by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.MicrosoftExcel-pkg-upload
ParentRecipe: com.github.jss-recipes.jss.MicrosoftExcel
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Excel
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
