Comment: Recipe automatically generated from com.github.jss-recipes.jss.Miro by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Miro-pkg-upload
ParentRecipe: com.github.dataJAR-recipes.pkg.Miro
MinimumVersion: '2.3'

Input:
  NAME: Miro
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
