Comment: Recipe automatically generated from com.github.jss-recipes.jss.MplayerX by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.MplayerX-pkg-upload
ParentRecipe: io.github.hjuutilainen.pkg.MPlayerX
MinimumVersion: '2.3'

Input:
  NAME: MplayerX
  CATEGORY: Digital Media

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
