Comment: Recipe automatically generated from com.github.jss-recipes.jss.MySQLWorkBench by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.MySQLWorkBench-pkg-upload
ParentRecipe: com.github.homebysix.pkg.MySQLWorkbench
MinimumVersion: '2.3'

Input:
  NAME: MySQLWorkBench
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
