Comment: Recipe automatically generated from com.github.jss-recipes.jss.NameMangler by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.NameMangler-pkg-upload
ParentRecipe: com.github.homebysix.pkg.NameMangler
MinimumVersion: '2.3'

Input:
  NAME: Name Mangler
  CATEGORY: Utility

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
