Comment: Recipe automatically generated from com.github.jss-recipes.jss.NodeJS by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.NodeJS-pkg-upload
ParentRecipe: com.github.novaksam.pkg.NodeJS
MinimumVersion: '2.3'

Input:
  NAME: NodeJS
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
