Comment: Recipe automatically generated from com.github.jss-recipes.jss.OpenEmu by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.OpenEmu-pkg-upload
ParentRecipe: com.github.homebysix.pkg.OpenEmu
MinimumVersion: '2.3'

Input:
  NAME: OpenEmu
  CATEGORY: Games

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
