Comment: Recipe automatically generated from com.github.jss-recipes.jss.Opera by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Opera-pkg-upload
ParentRecipe: com.github.amsysuk-recipes.pkg.opera
MinimumVersion: '2.3'

Input:
  NAME: Opera
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
