Comment: Recipe automatically generated from com.github.jss-recipes.jss.Paparazzi by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Paparazzi-pkg-upload
ParentRecipe: com.github.homebysix.pkg.Paparazzi
MinimumVersion: '2.3'

Input:
  NAME: Paparazzi
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
