Comment: Recipe automatically generated from com.github.jss-recipes.jss.Proximity by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Proximity-pkg-upload
ParentRecipe: com.github.homebysix.pkg.Proximity
MinimumVersion: '2.3'

Input:
  NAME: Proximity
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
