Comment: Recipe automatically generated from com.github.jss-recipes.jss.PyCharmCE by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.PyCharmCE-pkg-upload
ParentRecipe: com.github.hansen-m.pkg.pycharm
MinimumVersion: '2.3'

Input:
  NAME: PyCharm CE
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
