Comment: Recipe automatically generated from com.github.killahquam.jss.slack by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Slack-pkg-upload
ParentRecipe: com.github.killahquam.pkg.slack
MinimumVersion: '2.3'

Input:
  NAME: Slack
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
