Comment: Recipe automatically generated from com.github.jss-recipes.jss.Spotify by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Spotify-pkg-upload
ParentRecipe: com.github.homebysix.pkg.Spotify
MinimumVersion: '2.3'

Input:
  NAME: Spotify
  CATEGORY: Digital Media

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
