Comment: Recipe automatically generated from com.github.jss-recipes.jss.SublimeText3 by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.SublimeText3-pkg-upload
ParentRecipe: com.justinrummel.pkg.SublimeText3
MinimumVersion: '2.3'

Input:
  NAME: Sublime Text 3
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
