Comment: Recipe automatically generated from com.github.novaksam.jss.SuspiciousPackage by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.SuspiciousPackage-pkg-upload
ParentRecipe: com.github.novaksam.pkg.SuspiciousPackage
MinimumVersion: '2.3'

Input:
  NAME: Suspicious Package
  CATEGORY: Utilities

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
