Comment: Recipe automatically generated from com.github.crystalllized.jss.TheUnarchiver by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.TheUnarchiver-pkg-upload
ParentRecipe: com.github.autopkg.pkg.TheUnarchiver
MinimumVersion: '2.3'

Input:
  NAME: The Unarchiver
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
