Comment: Recipe automatically generated from com.github.jss-recipes.jss.Thunderbird by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Thunderbird-pkg-upload
ParentRecipe: com.github.autopkg.pkg.Thunderbird
MinimumVersion: '2.3'

Input:
  NAME: Thunderbird
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
