Comment: Recipe automatically generated from com.github.crystalllized.jss.TorBrowser by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.TorBrowser-pkg-upload
ParentRecipe: com.github.crystalllized.pkg.TorBrowser
MinimumVersion: '2.3'

Input:
  NAME: TorBrowser
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
