Comment: Recipe automatically generated from com.github.jss-recipes.jss.Transmit5 by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Transmit5-pkg-upload
ParentRecipe: com.github.autopkg.pkg.transmit5
MinimumVersion: '2.3'

Input:
  NAME: Transmit5
  CATEGORY: Computer Science

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
