Description: Downloads the latest version of Visual Studio Code and makes a pkg. Then, uploads to the Jamf Pro Server.
Identifier: com.github.grahampugh.recipes.jamf.VisualStudioCode-pkg-upload
MinimumVersion: "2.3"
ParentRecipe: com.github.killahquam.pkg.visualstudioscode

Input:
  CATEGORY: Productivity

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: Example Jamf recipes are being removed from grahampugh.recipes. Jamf recipes which are functionally equivalent to old jss recipes exist in app-specific folders.

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
