Comment: Recipe automatically generated from com.github.novaksam.jss.VLC by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.VLC-pkg-upload
ParentRecipe: com.github.autopkg.pkg.VLC
MinimumVersion: '2.3'

Input:
  NAME: VLC
  CATEGORY: Media

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
