Comment: Recipe automatically generated from com.github.novaksam.jss.Wireshark by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.Wireshark-pkg-upload
ParentRecipe: com.github.homebysix.pkg.Wireshark
MinimumVersion: '2.3'

Input:
  NAME: Wireshark
  CATEGORY: Utilities

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
