Comment: Recipe automatically generated from com.github.jss-recipes.jss.yo by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.yo-pkg-upload
ParentRecipe: com.github.jss-recipes.jss.yo
MinimumVersion: '2.3'

Input:
  NAME: yo
  CATEGORY: Management

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
