<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.MakeCatalogs</string>
	<key>Input</key>
	<dict/>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.makecatalogs</string>
    <key>Process</key>
    <array>
        <dict> 
            <key>Processor</key> 
            <string>com.github.grahampugh.recipes.SharedProcessor/MunkiGitCommitter</string> 
            <key>SharedProcessorRepo</key> 
            <string>https://github.com/grahampugh/recipes</string> 
            <key>Arguments</key>
            <dict>
                <key>MUNKI_REPO</key>
                <string>%MUNKI_REPO%</string>
            </dict>
        </dict> 
    </array>
</dict>
</plist>
