Description: Placeholder pkg recipe - just moves the pkg to create the pkg_path variable.
Identifier: com.github.grahampugh.recipes.pkg.macOSLAPS
ParentRecipe: com.github.grahampugh.recipes.download.macOSLAPS
MinimumVersion: "2.3"

Input:
  NAME: macOSLAPS

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/macOSLAPS-%version%.pkg"
      source_pkg: "%pathname%"
