Description: Downloads the latest version of Element and creates a package. Then, uploads to the Jamf Pro Server.
Identifier: com.github.grahampugh.recipes.jss.Element

Input:
  CATEGORY: Connect and Remote
  GROUP_NAME: "%NAME%-update-smart"
  GROUP_TEMPLATE: SmartGroup-update-smart-regex.xml
  TESTING_GROUP_NAME: Testing
  NAME: Element
  JSS_INVENTORY_NAME: Element (Riot).app
  POLICY_CATEGORY: Testing
  POLICY_NAME: "Install Latest %NAME%"
  POLICY_TEMPLATE: Policy-install-latest.xml
  SELF_SERVICE_DESCRIPTION: Element (formerly Riot) is an open source instant messaging client built on the Matrix protocol.
  SELF_SERVICE_ICON: Element.png

MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.recipes.pkg.Element

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Arguments:
      category: "%CATEGORY%"
      groups:
        - name: "%GROUP_NAME%"
          smart: true
          template_path: "%GROUP_TEMPLATE%"
      jss_inventory_name: "%JSS_INVENTORY_NAME%"
      policy_category: "%POLICY_CATEGORY%"
      policy_template: "%POLICY_TEMPLATE%"
      prod_name: "%NAME%"
      self_service_description: "%SELF_SERVICE_DESCRIPTION%"
      self_service_icon: "%SELF_SERVICE_ICON%"
    Processor: JSSImporter
