Description: Downloads the latest TeXLive Utility release and renames the pkg to include the version number. Then, uploads to the Jamf Pro Server.
Identifier: com.github.grahampugh.recipes.jss.TeXLiveUtility
MinimumVersion: 0.2.9
ParentRecipe: com.github.grahampugh.recipes.pkg.TeXLiveUtility

Input:
  CATEGORY: Productivity
  GROUP_NAME: "%NAME%-update-smart"
  GROUP_TEMPLATE: SmartGroup-update-smart-regex.xml
  TESTING_GROUP_NAME: Testing
  NAME: TeXLive Utility
  POLICY_CATEGORY: Testing
  POLICY_NAME: "Install Latest %NAME%"
  POLICY_TEMPLATE: Policy-install-latest.xml
  SELF_SERVICE_DESCRIPTION: TeX Live Utility is a Mac OS X graphical interface for TeX Live Manager, which is a tool provided with TeX Live 2008 and later, for updating, installing, and otherwise managing TeX Live. TeX Live Utility aims to provide a native Mac OS X interface for the most commonly used functions of the TeX Live Manager command-line tool.
  SELF_SERVICE_ICON: TeXLive Utility.png

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Arguments:
      category: "%CATEGORY%"
      groups:
        - name: "%GROUP_NAME%"
          smart: true
          template_path: "%GROUP_TEMPLATE%"
      policy_category: "%POLICY_CATEGORY%"
      policy_template: "%POLICY_TEMPLATE%"
      prod_name: "%NAME%"
      self_service_description: "%SELF_SERVICE_DESCRIPTION%"
      self_service_icon: "%SELF_SERVICE_ICON%"
    Processor: JSSImporter
