Description: Uploads the erase-install pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group. A run command is added to the policy which will reinstall macOS the volume.
Identifier: com.github.grahampugh.recipes.jss.upgrade-to-macos-catalina
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.recipes.pkg.erase-install

Input:
  CATEGORY: Administration
  GROUP_NAME: '%NAME% test users'
  GROUP_TEMPLATE: '%NAME%-SmartGroupTemplate-untested-users.xml'
  NAME: Upgrade to macOS Catalina
  POLICY_CATEGORY: Untested
  PROD_NAME: '%NAME%'
  POLICY_TEMPLATE: '%NAME%-PolicyTemplate-untested.xml'
  PROD_NAME: '%NAME%'
  RUN_COMMAND: /Library/Management/erase-install/erase-install.sh --os=10.15 --overwrite --reinstall
  SELF_SERVICE_DESCRIPTION: WARNING! This will download the latest version of macOS Catalina Beta and install it on the system volume. All work should be saved and backed up before starting.
  SELF_SERVICE_ICON: Install macOS Catalina.png
  SELF_SERVICE_INSTALL_BUTTON: Upgrade macOS
  SELF_SERVICE_REINSTALL_BUTTON: Upgrade macOS

Process:
- Arguments:
    category: '%CATEGORY%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    pkg_path: '%pkg_path%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%PROD_NAME%'
    self_service_description: '%SELF_SERVICE_DESCRIPTION%'
    self_service_icon: '%SELF_SERVICE_ICON%'
    version: '%version%'
  Processor: JSSImporter
