Description: Checks folder on locally mounted repo for update. Requires override of LIST_NAME and LOCAL_REPO.
Identifier: com.github.grahampugh.recipes.download.JamfProSuite
Input:
  EXCEPTION: ''
  LOCAL_REPO: /Volumes/Packaging/mac-resources
  LIST_NAME: Jamf_Pro_Suite
  VENDOR: JAMF_Software
MinimumVersion: 1.0.0
Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/SubDirectoryList
  Arguments:
    EXCEPTION: '%EXCEPTION%'
    root_path: '%LOCAL_REPO%/%VENDOR%/%LIST_NAME%'
- Processor: com.github.grahampugh.recipes.commonprocessors/LocalRepoUpdateChecker
  Arguments:
    RECIPE_CACHE_DIR: '%RECIPE_CACHE_DIR%'
    found_files: '%found_filenames%'
- Processor: StopProcessingIf
  Comment: 'Checks if the file already exists in the cache'
  Arguments:
    predicate: file_exists == True
- Processor: URLDownloader
  Comment: 'Downloads the file from the source repo to the AutoPkg cache'
  Arguments:
    url: file://%root_path%/%version%/%latest_file%.dmg
- Processor: EndOfCheckPhase
