<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>Install Production %PROD_NAME%</name>
        <enabled>true</enabled>
        <frequency>Ongoing</frequency>
        <category>
            <name>%CATEGORY%</name>
        </category>
    </general>
    <scope>
        <!--Scope added by JSSImporter-->
    </scope>
    <package_configuration>
        <!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
        <!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>%SELF_SERVICE_INSTALL_BUTTON%</install_button_text>
        <reinstall_button_text>%SELF_SERVICE_REINSTALL_BUTTON%</reinstall_button_text>
        <self_service_display_name>%SELF_SERVICE_DISPLAY_NAME%</self_service_display_name>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
        <self_service_categories>
            <category>
                <name>%CATEGORY%</name>
                <display_in>true</display_in>
                <feature_in>false</feature_in>
            </category>
        </self_service_categories>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
    <files_processes>
        <run_command>jamf policy -event "%TRIGGER_NAME%"</run_command>
    </files_processes>
</policy>
