Comment: Created with Recipe Robot v2.3.0 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of XQuartz and uploads the package to Jamf.
Identifier: com.github.grahampugh-recipes.jamf.XQuartz
Input:
  CATEGORY: Productivity
  NAME: XQuartz
MinimumVersion: "2.3"
ParentRecipe: com.github.scriptingosx.pkg.XQuartz
Process:
  - Arguments:
      category_name: "%CATEGORY%"
    Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  - Arguments:
      pkg_category: "%CATEGORY%"
    Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
