Description: Downloads the latest version of the core Munki Tools and makes a pkg of it then uploads it to the JSS, and creates a Self-Service Policy available to members of a Testing group.
Identifier: com.github.grahampugh.recipes.jss.MunkiToolsCore
Input:
  CATEGORY: Administration
  EXCLUSION_GROUP_NAME: '%NAME% test version installed'
  EXCLUSION_GROUP_TEMPLATE: SmartGroupTemplate-test-installed.xml
  EXTENSION_ATTRIBUTE: '%NAME%-ExtensionAttribute.xml'
  GROUP_NAME: '%NAME% test users'
  GROUP_TEMPLATE: SmartGroupTemplate-test-users.xml
  LANGUAGE: ML
  NAME: MunkiToolsCore
  POLICY_CATEGORY: Untested
  POLICY_LANGUAGE: ''
  POLICY_TEMPLATE: PolicyTemplate.xml
  PROD_NAME: '%NAME%'
MinimumVersion: 0.4.0
ParentRecipe: com.github.grahampugh.recipes.pkg.MunkiToolsCore
Process:
- Arguments:
    predicate: download_changed == False
  Comment: Checks if the file already exists in the cache
  Processor: StopProcessingIf
- Arguments:
    category: '%CATEGORY%'
    exclusion_groups:
    - name: '%EXCLUSION_GROUP_NAME%'
      smart: true
      template_path: '%EXCLUSION_GROUP_TEMPLATE%'
    extension_attributes:
    - ext_attribute_path: '%EXTENSION_ATTRIBUTE%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    pkg_path: '%RECIPE_CACHE_DIR%/repack/munkitools_core.pkg'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%NAME%'
  Processor: JSSImporter
