Description: Downloads the latest version of MathType.
Identifier: com.github.grahampugh.download.MathType
MinimumVersion: "2.3"

Input:
  DOWNLOAD_URL: https://store.wiris.com/en/products/downloads/mathtype/installer/mac/en

Process:
  - Processor: URLDownloader
    Arguments:
      filename: MathType-mac-en.pkg
      url: "%DOWNLOAD_URL%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: Design Science, Inc. (HNQ4485Q28)"
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: "%pathname%"
