Description: Downloads the latest version of MathType and creates a pkg including version number.
Identifier: com.github.grahampugh.pkg.MathType
ParentRecipe: com.github.grahampugh.download.MathType
MinimumVersion: "2.3"

Input:
  NAME: MathType

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/root"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/mathtype.pkg/Payload"
      purge_destination: true

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/root/Applications/MathType/MathType.app/Contents/Info.plist"

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/root"
        - "%RECIPE_CACHE_DIR%/unpack"
