Description: |
  Downloads the loopdown zip archive.
Identifier: com.github.grahampugh.recipes.download.loopdown
MinimumVersion: "2.3"

Input:
  NAME: loopdown

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: ((?P<url>https://api.github.com/repos/carlashley/loopdown/zipball/(?P<version>.*))\")
      url: https://api.github.com/repos/carlashley/loopdown/releases/latest

  - Processor: URLDownloader
    Arguments:
      filename: loopdown-%version%.zip


  - Processor: EndOfCheckPhase
