Description: Downloads the current version of Howard Oakley's silnite, and creates a pkg.
Identifier: com.github.grahampugh.recipes.pkg.silnite
ParentRecipe: com.github.grahampugh.recipes.download.silnite
MinimumVersion: "2.3"

Input: {}

Process:
  # This is a very hacky hack to get the Version
  - Processor: com.github.homebysix.VersionSplitter/VersionSplitter
    Arguments:
      version: "%pathname%"
      split_on: downloads/silnite
      index: 1

  - Processor: com.github.homebysix.VersionSplitter/VersionSplitter
    Arguments:
      version: "%version%"
      split_on: .zip
      index: 0

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/silnite-%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/unzip/silnite*/silniteInstaller.pkg"
