Description: Downloads the latest version of SeqMonk and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.SeqMonk
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.recipes.download.SeqMonk

Input:
  NAME: SeqMonk
  BUNDLE_ID: uk.ac.babraham.seqmonk

Process:
  - Processor: Copier
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.app"
      overwrite: True
      source_path: "%pathname%/%NAME%.app"

  - Processor: PlistEditor
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist"
      output_plist_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist"
      plist_data:
        CFBundleShortVersionString: "%version%"
        CFBundleIdentifier: "%BUNDLE_ID%"

  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.app"
      force_pkg_build: False
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
