Description: Downloads the latest version of Affinity Photo and creates a pkg including version number.
Identifier: com.github.grahampugh.recipes.pkg.AffinityPhoto
ParentRecipe: com.github.peterkelm.download.AffinityPhoto
MinimumVersion: "2.3"

Input:
  NAME: Affinity Photo

Process:
  - Processor: AppPkgCreator
