Description: Downloads the latest version of mergen and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.mergen
ParentRecipe: com.github.grahampugh.recipes.download.mergen
MinimumVersion: "2.3"

Input:
  NAME: mergen

Process:
  - Processor: AppPkgCreator
