Description: Checks folder on locally mounted repo for update. Requires override of LIST_NAME and LOCAL_REPO.
Identifier: com.github.grahampugh.recipes.download.Maple
Input:
  LIST_NAME: Maple
  LICENSE: Floating
  LIMITATION: '2018'
  LOCAL_REPO: /Volumes/Packaging/mac-packages
  VENDOR: MapleSoft
MinimumVersion: 1.0.0
Process:
- Arguments:
    LIMITATION: '%LIMITATION%'
    root_path: '%LOCAL_REPO%/%VENDOR%/%LIST_NAME%'
  Processor: com.github.grahampugh.recipes.commonprocessors/SubDirectoryList
- Arguments:
    RECIPE_CACHE_DIR: '%RECIPE_CACHE_DIR%'
    found_files: '%found_filenames%'
  Processor: com.github.grahampugh.recipes.commonprocessors/LocalRepoUpdateChecker
- Arguments:
    predicate: file_exists == True
  Comment: Checks if the file already exists in the cache
  Processor: StopProcessingIf
- Arguments:
    url: file://%root_path%/%version%/%latest_file%.dmg
  Comment: Downloads the file from the source repo to the AutoPkg cache
  Processor: URLDownloader
- Processor: EndOfCheckPhase
