<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current script of homebrew.sh.
</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.download.homebrew-install</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>homebrew-install</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;\/Honestpuck\/homebrew\.sh\/blob\/master\/(?P&lt;script_name&gt;homebrew-(?P&lt;version&gt;.*?)\.sh))</string>
				<key>url</key>
				<string>https://github.com/Honestpuck/homebrew.sh</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
