<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a package for Parallels Desktop.
This is done with the help of the pd-autodeploy file obtained from Parallels website.
There is no download recipe since Parallels Desktop is not publicly available.
Requires running as: autopkg run --pkg /path/to/downloaded-parallels.dmg "ParallelsDesktop.pkg"
You must override the LICENSE_KEY.
It is also possible to override the software update settings. See ParallelsDesktopPackager.py for details.
</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.pkg.ParallelsDesktop</string>
	<key>Input</key>
	<dict>
		<key>LICENSE_KEY</key>
		<integer>1234567890</integer>
		<key>NAME</key>
		<string>Parallels Desktop</string>
		<key>SOFTWARE_UPDATES_AUTO_DOWNLOAD</key>
		<false/>
		<key>SOFTWARE_UPDATES_CHECK</key>
		<integer>0</integer>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>pd-autodeploy.zip</string>
				<key>url</key>
				<string>http://download.parallels.com/desktop/tools/pd-autodeploy.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%filename%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Parallels Desktop Business Edition mass deployment package*</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Parallels_Desktop_%version%.pkg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%found_filename%/Parallels Desktop Autodeploy.pkg</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Parallels_Desktop_%version%.pkg/Parallels Desktop DMG/%NAME%.dmg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%latest_file%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>CONFIG_FILE_PATH</key>
				<string>%RECIPE_CACHE_DIR%/Parallels_Desktop_%version%.pkg/License Key and Configuration/deploy.cfg</string>
				<key>INFO_PLIST_PATH</key>
				<string>%RECIPE_CACHE_DIR%/Parallels_Desktop_%version%.pkg/Contents/Info.plist</string>
				<key>license_key</key>
				<string>%LICENSE_KEY%</string>
				<key>software_updates_auto_download</key>
				<string>%SOFTWARE_UPDATES_AUTO_DOWNLOAD%</string>
				<key>software_updates_check</key>
				<string>%SOFTWARE_UPDATES_CHECK%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>ParallelsDesktopPackager</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
