Identifier: multitenant-jamf-tools.jamf.DeleteUnusedPackages
MinimumVersion: "2.3"

Input:
  DRY_RUN: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfUnusedPackageCleaner
    Arguments:
      output_dir: /Users/Shared/Jamf/JamfUploader
      dry_run: "%DRY_RUN%"
