Description: Downloads the latest version of DjView and creates a pkg including version number.
Identifier: com.github.grahampugh.recipes.pkg.DjView
ParentRecipe: com.github.grahampugh.recipes.download.DjView
MinimumVersion: 1.0.0

Input:
  NAME: DjView

Process:
- Processor: AppPkgCreator
