Description: Downloads the latest version of Microsoft's Office 365 Suite installer package and renames the package.
Identifier: com.github.grahampugh.recipes.pkg.MicrosoftOffice365
ParentRecipe: com.github.grahampugh.recipes.download.MicrosoftOffice365
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office 365
  PKG_NAME: MicrosoftOffice365Suite
  VERSIONING_STRING: OneNote

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/downloads/unpack"
      flat_pkg_path: "%pathname%"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/downloads/unpack/*%VERSIONING_STRING%*.pkg"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/downloads/payload"
      pkg_payload_path: "%found_filename%/Payload"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/downloads/payload/Microsoft %VERSIONING_STRING%.app/Contents/Info.plist"
      plist_version_key: CFBundleVersion

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%PKG_NAME%-%version%.pkg"
      source_pkg: "%pathname%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/downloads/unpack"
        - "%RECIPE_CACHE_DIR%/downloads/payload"
