Description: |
    Downloads the Adobe Shared Device Licensing Toolkit. This can be used to deactivate Adobe Shared Device Licenses on a client.
Identifier: com.github.grahampugh.recipes.download.AdobeLicensingToolkit
MinimumVersion: 1.0.0

Input:
  NAME: Adobe Licensing Toolkit

Process:
- Arguments:
    url: https://www.adobe.com/go/licensing_toolkit_mac
    filename: adobe-licensing-toolkit.dmg
  Processor: URLDownloader

- Processor: EndOfCheckPhase
