Description: Downloads the current release version of Adobe Licensing Toolkit and builds a package.
Identifier: com.github.grahampugh.recipes.pkg.AdobeLicensingToolkit
Input:
  NAME: Adobe Licensing Toolkit
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.recipes.download.AdobeLicensingToolkit

Process:
- Arguments:
    pkgdirs:
      Library: '0755'
      Library/Management: '0755'
      Library/Management/Adobe: '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
  Processor: PkgRootCreator

- Arguments:
    source_path: '%pathname%/adobe-licensing-toolkit'
    destination_path: '%pkgroot%/Library/Management/Adobe/adobe-licensing-toolkit'
    overwrite: True
  Processor: Copier

- Arguments:
    resource_path: '%pkgroot%/Library/Management/Adobe/adobe-licensing-toolkit'
    mode: '755'
    owner: root
    group: wheel
  Processor: com.github.grahampugh.recipes.commonprocessors/ChangeModeOwner


- Arguments:
    pkg_request:
      chown:
      - group: wheel
        path: Library
        user: root
      - group: wheel
        path: Library/Management
        user: root
      - group: wheel
        path: Library/Management/Adobe
        user: root
      id: com.adobe.adobe-licensing-toolkit
      options: purge_ds_store
      pkgname: 'adobe-licensing-toolkit'
      version: '1.0'
    force_pkg_build: True
  Processor: PkgCreator

- Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/pkgroot'
  Processor: PathDeleter
