Comment: Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of LineIn and imports it into Munki.
Identifier: com.grahamrpugh.munki.LineIn
ParentRecipe: com.grahamrpugh.download.LineIn
MinimumVersion: 0.6.1

Input:
  NAME: LineIn
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: Enables soft audio playthru from input devices.
    developer: Rogue Amoeba Software, LLC
    display_name: LineIn
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%/Applications'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
