Description: Downloads latest FileMaker Pro Advanced updater disk image and extracts the package from within.
Identifier: com.github.grahampugh.recipes.download.filemakerproadvanced

Input:
  NAME: FileMaker Pro Advanced
  MAJOR_VERSION: '18'
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
- Arguments:
    major_version: '%MAJOR_VERSION%'
  Processor: FilemakerProAdvancedUpdateURLProcessor

- Arguments:
    url: 'https://fmdl.filemaker.com/esd/fmpa_%version%.dmg'
  Processor: URLDownloader

- Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'
  Processor: StopProcessingIf
