Description: |
    Creates a package for FileMaker Pro Advanced.
    There is no download recipe since FileMaker Pro Advanced is not publicly available.
    Requires running as: autopkg run --pkg /path/to/downloaded-fmpa.dmg "FilemakerProAdvanced.pkg"
    You must also override the keys LICENSE_KEY and LICENSED_ORG.
Identifier: com.github.grahampugh.recipes.pkg.FilemakerProAdvanced
Input:
  NAME: FileMaker Pro Advanced
  LICENSE_KEY: 1234567890
  LICENSED_ORG: Example
Process:
- Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
  Processor: PkgRootCreator
- Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/Scripts'
  Processor: PkgRootCreator
- Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/temp_for_version'
  Processor: PkgRootCreator
- Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/temp_unpack'
  Processor: PkgRootCreator
- Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/Scripts/FileMakerProAdvancedInstaller.pkg'
    source_pkg: '%pathname%/*.pkg'
  Processor: PkgCopier
- Processor: FlatPkgUnpacker
  Arguments:
    purge_destination: true
    destination_path: '%RECIPE_CACHE_DIR%/temp_for_version'
    flat_pkg_path: '%pkg_path%'
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/temp_for_version/fmpa*Application.pkg'
- Processor: PkgPayloadUnpacker
  Arguments:
    purge_destination: true
    destination_path: '%RECIPE_CACHE_DIR%/temp_unpack'
    pkg_payload_path: '%found_filename%/Payload'
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/temp_unpack/FileMaker Pro Advanced.app/Contents/Info.plist'
- Arguments:
    file_content: |
      AI_USERNAME=OS X Administrator
      AI_ORGANIZATION=%LICENSED_ORG%
      AI_LICENSEKEY=%LICENSE_KEY%
      AI_NONEWDATABASES=0
      AI_REGISTRATION=0
      AI_SKIPDIALOG=1
      AI_DISABLEUPDATENOTIFY=1
      AI_DISABLEVERSIONNOTIFY=1
      AI_DISABLEPLUGINS=0
      AI_DISABLEXDBC=0
      AI_DISABLEIWP=0
      AI_LICENSE_ACCEPTED=1
    file_mode: '0644'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/Assisted Install.txt'
  Processor: FileCreator
- Arguments:
    file_content: |
      #!/bin/sh

      installer -tgt / -pkg FileMakerProAdvancedInstaller.pkg
    file_mode: '0755'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/postinstall'
  Processor: FileCreator
- Arguments:
    force_pkg_build: true
    pkg_request:
      chown: []
      id: com.filemaker.pkg.FileMakerProAdvancedInstaller
      pkgname: '%LIST_NAME%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      scripts: Scripts
      version: '%version%'
  Processor: PkgCreator
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/temp_for_version'
    - '%RECIPE_CACHE_DIR%/temp_unpack'
    - '%RECIPE_CACHE_DIR%/Scripts'
    - '%RECIPE_CACHE_DIR%/pkgroot'
