Description: Downloads the latest version of Microsoft Office 365 and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.MicrosoftOffice365
MinimumVersion: 2.0.0
ParentRecipe: com.github.grahampugh.recipes.pkg.MicrosoftOffice365

Input:
  NAME: Microsoft Office 365
  JSS_INVENTORY_NAME: Microsoft Word.app
  INSTALLED_REGEX_MATCH: '^(16\.1[7-9]\.|16\.[2-9]\d\.|17\.)'
  OS_EXCLUDE_MIN: 10.0.0
  OS_EXCLUDE_MAX: 10.13.6
  OS_LIMITS_GROUP_NAME: "macOS %OS_EXCLUDE_MAX% or less"
  EXCLUSION_GROUP_TEMPLATE: SmartGroup-OSVersionLimits.xml
  CATEGORY: Productivity
  GROUP_NAME: "%NAME%-update-smart"
  GROUP_TEMPLATE: SmartGroup-update-smart-MicrosoftOffice365.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: Policy-install-latest-MicrosoftOffice365.xml
  POLICY_NAME: "Install Latest %NAME%"
  SCRIPT_NAME: Microsoft Office License Removal Tool.sh
  PARAMETER4_TITLE: "--All or --O365 or --Volume"
  PARAMETER5_TITLE: "--ForceClose"
  PARAMETER6_TITLE: "--jamfUser"
  PARAMETER4_VALUE: "--Volume"
  PARAMETER5_VALUE: "--ForceClose"
  PARAMETER6_VALUE: "--jamfUser"
  SCRIPT_PRIORITY: Before
  SELF_SERVICE_DISPLAY_NAME: "Install Latest %NAME%"
  SELF_SERVICE_DESCRIPTION: |
    Microsoft Office 365 includes the following applications:
    - Microsoft Word
    - Microsoft Excel
    - Microsoft PowerPoint
    - Microsoft Outlook
    - Microsoft OneNote
    - Microsoft OneDrive
    - Microsoft Teams
  SELF_SERVICE_ICON: "%NAME%.png"
  INSTALL_BUTTON_TEXT: "Install %version%"
  REINSTALL_BUTTON_TEXT: "Install %version%"
  UPDATE_PREDICATE: "pkg_uploaded == False"
  replace_policy: "True"
  replace_group: "True"
  replace_script: "True"
  curl: "True"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%PARAMETER4_TITLE%"
      script_parameter5: "%PARAMETER5_TITLE%"
      script_parameter6: "%PARAMETER6_TITLE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%EXCLUSION_GROUP_TEMPLATE%"
      computergroup_name: "%OS_LIMITS_GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELF_SERVICE_ICON%"
