<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest EndNote updates and unzips the contents.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.download.EndNoteUpdates</string>
	<key>Input</key>
	<dict>
		<key>INT_VERSION</key>
		<string>19</string>
		<key>MAJOR_VERSION</key>
		<string>X9</string>
		<key>NAME</key>
		<string>EndNote</string>
		<key>version</key>
		<string>latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(/updates/%INT_VERSION%.0/EndNote%MAJOR_VERSION%[0-9]*UpdateInstaller.zip)</string>
				<key>url</key>
				<string>http://download.endnote.com/updates/%INT_VERSION%.0/EN%INT_VERSION%MacUpdates.xml</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>http://download.endnote.com%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%MAJOR_VERSION%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%MAJOR_VERSION%/*/*.app</string>
				<key>requirement</key>
				<string>anchor trusted</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(updateTo\&gt;(?P&lt;version&gt;.*?)\&lt;\/updateTo)</string>
				<key>url</key>
				<string>http://download.endnote.com/updates/%INT_VERSION%.0/EN%INT_VERSION%MacUpdates.xml</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
	</array>
</dict>
</plist>
