Description: Downloads the latest version of Riot.im.
Identifier: com.github.grahampugh.recipes.download.Element
MinimumVersion: "2.3"

Input:
  NAME: Element (Riot)
  DOWNLOAD_URL: https://element.io/download

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"(?P<match>https://packages\.riot\.im/desktop/install/macos/Element\.dmg)"'
      url: "%DOWNLOAD_URL%"

  - Processor: URLDownloader
    Arguments:
      filename: Element.dmg
      url: "%match%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Element.app"
      requirement: identifier "im.riot.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7J4U792NQT"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/Element.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString
