<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Riot and creates a package. Note that this recipe has been deprecated, as Riot has been renamed to Element (Riot). Please use the Element recipes instead.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.pkg.Riot</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>im.riot.app</string>
		<key>NAME</key>
		<string>Riot</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.download.Riot</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe has been deprecated, as Riot has been renamed to Element (Riot). Please use the Element recipes instead.</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
