Description: Downloads the latest version of Threema.
Identifier: com.github.grahampugh.recipes.download.Threema
MinimumVersion: "2.3"

Input:
  NAME: Threema
  DOWNLOAD_URL: "https://releases.threema.ch/web-electron/v1/release/Threema-Latest.dmg"

Process:
  - Processor: URLDownloader
    Arguments:
      filename: Threema-Latest.dmg
      url: "%DOWNLOAD_URL%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Threema.app"
      requirement: identifier "threema-web" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = DL5SR3PBJC
