Description: Downloads the current version of The Microsoft Office Factory Reset package.
Identifier: com.github.grahampugh.recipes.pkg.MicrosoftOfficeFactoryReset
ParentRecipe: com.github.grahampugh.recipes.download.MicrosoftOfficeFactoryReset
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office Factory Reset

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/MicrosoftOfficeFactoryReset-%version%.pkg"
      source_pkg: "%pathname%"
