Description: Downloads the current version of The Microsoft License Reset package.
Identifier: com.github.grahampugh.recipes.download.MicrosoftLicenseReset
MinimumVersion: "2.3"

Input:
  NAME: Microsoft License Reset

Process:
  - Processor: URLDownloader
    Arguments:
      url: "https://go.microsoft.com/fwlink/?linkid=849815"
      filename: "Microsoft_License_Reset.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: Paul Bowden (QGS93ZLCU7)"
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: "%pathname%"
