Description: Downloads the current version of The Microsoft Office Removal package.
Identifier: com.github.grahampugh.recipes.pkg.MicrosoftOfficeRemoval
ParentRecipe: com.github.grahampugh.recipes.download.MicrosoftOfficeRemoval
MinimumVersion: "2.3"

Input:
  NAME: Microsoft Office Removal

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/MicrosoftOfficeRemoval-%version%.pkg"
      source_pkg: "%pathname%"
