Description: Downloads the current version of The Microsoft License Reset package.
Identifier: com.github.grahampugh.recipes.pkg.MicrosoftLicenseReset
ParentRecipe: com.github.grahampugh.recipes.download.MicrosoftLicenseReset
MinimumVersion: "2.3"

Input:
  NAME: Microsoft License Reset

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/MicrosoftLicenseReset-%version%.pkg"
      source_pkg: "%pathname%"
