Description: Downloads the current version of The Microsoft License Reset package.
Identifier: com.github.grahampugh.recipes.download.MicrosoftLicenseReset
MinimumVersion: "2.3"

Input:
  NAME: Microsoft License Reset

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<url>https://github.com/cocopuff2u/MOFA/raw/refs/heads/main/office_reset_tools/office_reset_archived/packages/Office-Reset.com_Microsoft_License_Reset_(?P<version>.*?)\.pkg)
      url: https://mofa.cocolabs.dev/macos_tools/microsoft_office_repair_tools.html

  - Processor: URLDownloader

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: Paul Bowden (QGS93ZLCU7)"
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: "%pathname%"
