Comment: This example recipe can simply be an override rather than a full recipe.
Description: Creates a script and a Self-Service uninstaller policy for Carbon Copy Cloner.
Identifier: com.github.grahampugh.recipes.jss-uninstall.CarbonCopyCloner
ParentRecipe: com.github.grahampugh.recipes.jss-uninstall.UninstallApplication
MinimumVersion: 1.0.0

Input:
  NAME: Carbon Copy Cloner
  PKG_ID: com.bombich.ccc

Process: []
