Description: Creates a script and a Self-Service uninstaller policy for Carbon Copy Cloner.
Comment: This example recipe can simply be an override rather than a full recipe.
Identifier: com.github.grahampugh.recipes.jss-uninstall.CarbonCopyCloner
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.recipes.jss-uninstall.UninstallApplication

Input:
  NAME: Carbon Copy Cloner
  PKG_ID: com.bombich.ccc
Process: {}
