Description: Downloads the current release version of Adobe Licensing Toolkit and builds a package.
Identifier: com.github.grahampugh.recipes.pkg.AdobeLicensingToolkit
ParentRecipe: com.github.grahampugh.recipes.download.AdobeLicensingToolkit
MinimumVersion: "2.3"

Input:
  NAME: Adobe Licensing Toolkit

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Library: "0755"
        Library/Management: "0755"
        Library/Management/Adobe: "0755"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Library/Management/Adobe/adobe-licensing-toolkit"
      overwrite: true
      source_path: "%pathname%/adobe-licensing-toolkit"

  - Processor: com.github.grahampugh.recipes.commonprocessors/ChangeModeOwner
    Arguments:
      group: wheel
      mode: "755"
      owner: root
      resource_path: "%pkgroot%/Library/Management/Adobe/adobe-licensing-toolkit"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: wheel
            path: Library
            user: root
          - group: wheel
            path: Library/Management
            user: root
          - group: wheel
            path: Library/Management/Adobe
            user: root
        id: com.adobe.adobe-licensing-toolkit
        options: purge_ds_store
        pkgname: adobe-licensing-toolkit
        version: "1.0"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkgroot"
