Description: "Downloads the latest Microsoft Office 365 SKU-less installer package.\nOverride the PRODUCTID key to:\n- 525133 for Americas\n- 532572 for Europe\n- 532577 for Asia\n- 871743 for Office 2016\n- 2009112 for Office365 Business Pro (includes Teams)\n"
Identifier: com.github.grahampugh.recipes.download.MicrosoftOffice365
MinimumVersion: 1.0.0

Input:
  NAME: Microsoft Office Suite
  DOWNLOADURL: https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%
  PKG_NAME: MicrosoftOffice365Suite
  PRODUCTID: '532572'
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%PKG_NAME%.pkg'
    url: '%DOWNLOADURL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Microsoft Corporation (UBF8T346G9)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
