Description: Downloads the latest Unison release and copies it to the recipe cache root.
Identifier: com.github.grahampugh.recipes.pkg.unison
ParentRecipe: com.github.grahampugh.recipes.download.unison
MinimumVersion: "2.3"

Input:
  NAME: Unison

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/Applications"
      purge_destination: true

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/Applications/Unison.app/Contents/Info.plist"

  - Processor: Copier
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Applications/Unison.app"
      overwrite: true
      source_path: "%RECIPE_CACHE_DIR%/Applications/Unison.app"

  - Processor: PkgCreator
    Arguments:
      force_pkg_build: true
      pkg_request:
        chown: []
        id: edu.upenn.cis.Unison.pkg
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        version: "%version%"
