<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ISL Light Client and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.pkg.ISLLightClient</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.islonline.isllight.client</string>
		<key>NAME</key>
		<string>ISL Light Client</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.download.ISLLightClient</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
