Description: Downloads the latest version of erase-install and creates a package containing the script. The expectation is that this would be used with a postinstall script containing the parameters required to use this script for upgrading or reinstalling macOS on clients.
Identifier: com.github.grahampugh.recipes.pkg.erase-install
Input:
  NAME: erase-install
ParentRecipe: com.github.grahampugh.recipes.download.erase-install
MinimumVersion: 1.0.0

Process:
- Arguments:
    pkgdirs:
      Library: '0755'
      Library/Management: '0755'
      Library/Management/erase-install: '0700'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
  Processor: PkgRootCreator

- Arguments:
    source_path: '%RECIPE_CACHE_DIR%/%NAME%/erase-install-%version%/erase-install.sh'
    destination_path: '%RECIPE_CACHE_DIR%/pkgroot/Library/Management/erase-install/erase-install.sh'
  Processor: Copier

- Arguments:
    force_pkg_build: True
    pkg_request:
      id: com.github.grahampugh.erase-install.pkg
      pkgname: '%NAME%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      version: '%version%'
      chown:
      - group: wheel
        path: Library
        user: root
      - group: wheel
        path: Library/Management
        user: root
      - group: wheel
        path: /Library/Management/erase-install
        user: root
  Processor: PkgCreator

- Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/pkgroot'
  Processor: PathDeleter
