Description: |
    Downloads the current script of erase-install 11.
Identifier: com.github.grahampugh.recipes.download.erase-install
Input:
  NAME: erase-install
  STOP_IF: download_changed == False
MinimumVersion: 1.0.0
Process:
- Arguments:
    asset_regex: ^erase-install-.*?.zip$
    github_repo: grahampugh/erase-install
    include_prereleases: True
  Processor: GitHubReleasesInfoProvider
- Processor: URLDownloader
- Processor: EndOfCheckPhase
- Arguments:
    predicate: '%STOP_IF%'
  Comment: Checks if the file already exists in the cache
  Processor: StopProcessingIf
- Arguments:
    archive_path: '%pathname%'
    purge_destination: true
  Processor: Unarchiver
