Description: Downloads the latest version of MestReNova
Identifier: com.github.grahampugh.recipes.download.MestReNova
MinimumVersion: 1.0.0

Input:
  DOWNLOAD_URL: https://mestrelab.com/downloads/mnova/mac
  NAME: MestReNova
  SEARCH_URL: https://mestrelab.com/download/mnova/

Process:
  - Arguments:
      re_pattern: MestReNova-(?P<version>(?P<pkgversion>.*?)-.*?)\.dmg
      url: "%SEARCH_URL%"
    Processor: URLTextSearcher

  - Arguments:
      url: "%DOWNLOAD_URL%/MestReNova-%version%.dmg"
    Processor: URLDownloader

  - Processor: EndOfCheckPhase

  - Arguments:
      input_path: "%pathname%/%NAME%.app"
      requirement: identifier "com.mestrelab.MestReNova" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = DH5EKRR34H
    Processor: CodeSignatureVerifier
