Description: Downloads the current version of Jamf Compliance Editor
Identifier: com.github.grahampugh.recipes.download.JamfComplianceEditor
MinimumVersion: "2.3"

Input:
  NAME: Jamf Compliance Editor

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: Jamf-Concepts/jamf-compliance-editor
      asset_regex: JamfComplianceEditor\.v.*\.pkg

  - Processor: URLDownloader
    Arguments:
      filename: "JamfComplianceEditor-%version%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: JAMF Software (483DWKW443)"
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: "%pathname%"
