Description: Downloads the current version of Jamf Compliance Editor
Identifier: com.github.grahampugh.recipes.download.JamfComplianceEditor
MinimumVersion: "2.3"

Input:
  NAME: Jamf Compliance Editor

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<url>https://.*/Images/Documentation/Jamf%20Compliance%20Editor%20.*.tar.gz.*)\".*(?P<filename>Jamf Compliance Editor.*.tar.gz?)
      url: https://trusted.jamf.com/docs/establishing-compliance-baselines
      request_headers:
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_5) AppleWebKit/600.8.9 (KHTML, like Gecko) Version/8.0.8 Safari/600.8.9

  - Processor: URLDownloader
    Arguments:
      url: "%url%"
      filename: "%filename%"

  - Processor: EndOfCheckPhase

  - Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: True
    Processor: Unarchiver

  - Processor: CodeSignatureVerifier
    Arguments:
      requirement: anchor apple generic and identifier "com.jamf.complianceeditor" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "483DWKW443")
      input_path: "%RECIPE_CACHE_DIR%/unzip/Jamf Compliance Editor.app"
