Description: Downloads the current version of Jamf Compliance Editor
Identifier: com.github.grahampugh.recipes.download.JamfComplianceEditor
MinimumVersion: "2.3"

Input:
  NAME: Jamf Compliance Editor

Process:
  - Processor: URLTextSearcher
    Arguments:
      # re_pattern: (<a href=\"(?P<url>\/\/cdn\.document360.io\/\b[0-9a-f]{8}\b-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-\b[0-9a-f]{12}\b/Images/Documentation/(?P<filename>JamfComplianceEditor%20v.*\.pkg?)\?.*)\"JamfComplianceEditor .[0-9\.]\.pkg<\/a>)
      re_pattern: (<a href=\"(?P<url>\/\/cdn\.document360.io\/\b[0-9a-f]{8}\b-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-\b[0-9a-f]{12}\b/Images/Documentation/JamfComplianceEditor%20v.*\.pkg\?.*)\">(?P<filename>JamfComplianceEditor\ v(?P<version>.*)\.pkg)</a>)
      url: https://trusted.jamf.com/docs/establishing-compliance-baselines
      request_headers:
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_5) AppleWebKit/600.8.9 (KHTML, like Gecko) Version/8.0.8 Safari/600.8.9

  - Processor: com.github.grahampugh.recipes.commonprocessors/StringReplacer
    Arguments:
      input_string: "%url%"
      string_to_replace: "&amp;"
      replacement_string: "&"

  - Processor: URLDownloader
    Arguments:
      url: "https:%output_string%"
      filename: "%filename%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: JAMF Software (483DWKW443)"
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: "%pathname%"
