Description: Downloads the latest version of Jamf Compliance Editor and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.JamfComplianceEditor
ParentRecipe: com.github.grahampugh.recipes.download.JamfComplianceEditor
MinimumVersion: "2.3"

Input:
  NAME: Jamf Compliance Editor

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/unzip/Jamf Compliance Editor.app"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unzip"
