Description: Downloads the latest version of Jamf Compliance Editor and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.JamfComplianceEditor
ParentRecipe: com.github.grahampugh.recipes.download.JamfComplianceEditor
MinimumVersion: "2.3"

Input:
  NAME: Jamf Compliance Editor

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/JamfComplianceEditor-%version%.pkg"
      source_pkg: "%pathname%"
