Description: |
    Downloads the current release version of AdoptOpenJDK 11. This is based from the tar version rather than the signed pkg version, so that the true version number can be obtained.

    Note that the "hotspot" versions have been removed from AdoptOpenJDK's GitHub, so this recipe has now switched to the remaining Eclipse OpenJ9 version of Adopt OpenJDK 11.
Identifier: com.github.grahampugh.recipes.download.AdoptOpenJDK11
MinimumVersion: 1.0.0

Input:
  NAME: AdoptOpenJDK 11
  STOPPROCESSINGIF_PREDICATE: download_changed == False

Process:
- Arguments:
    re_pattern: (?P<match>AdoptOpenJDK\/openjdk11-binaries\/releases\/download\/jdk11.*?\/OpenJDK11U-jdk_x64_mac_openj9_.*?\.tar\.gz)
    url: https://github.com/AdoptOpenJDK/openjdk11-binaries/releases
  Processor: URLTextSearcher

- Arguments:
    url: 'https://github.com/%match%'
  Processor: URLDownloader

- Processor: EndOfCheckPhase

- Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'
  Comment: Checks if the file already exists in the cache
  Processor: StopProcessingIf
