Description: Downloads the current release version of AdoptOpenJDK 8 OpenJ9. Recipe created by Charles Mission.
Identifier: com.github.grahampugh.recipes.download.AdoptOpenJDK8_OpenJ9_Signed
Input:
  NAME: AdoptOpenJDK 8 OpenJ9
  STOPPROCESSINGIF_PREDICATE: download_changed == False
MinimumVersion: 1.0.0
Process:
- Arguments:
    asset_regex: ^OpenJDK8U-jdk_x64_mac_openj9_.*?.pkg$
    github_repo: AdoptOpenJDK/openjdk8-binaries
  Processor: GitHubReleasesInfoProvider
- Processor: URLDownloader
- Processor: EndOfCheckPhase
- Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'
  Comment: Checks if the file already exists in the cache
  Processor: StopProcessingIf
- Arguments:
    expected_authority_names:
    - 'Developer ID Installer: London Jamocha Community CIC (VDX7B37674)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
  Processor: CodeSignatureVerifier
