Description: Downloads the latest version of MAXQDA and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.MAXQDA
ParentRecipe: com.github.its-unibas.download.MAXQDA
MinimumVersion: "2.3"

Input:
  NAME: MAXQDA
  VERSION: "2020"

Process:
  - Processor: AppPkgCreator
    Arguments:
      force_pkg_build: true
