Description: Downloads the latest version of MestReNova and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.MestReNova-tmp
ParentRecipe: com.github.grahampugh.recipes.download.MestReNova-tmp
MinimumVersion: "2.3"

Input:
  NAME: MestReNova

Process:
  - Processor: AppPkgCreator
