Description: Downloads the latest version of MestReNova
Identifier: com.github.grahampugh.recipes.download.MestReNova
MinimumVersion: "2.3"

Input:
  NAME: MestReNova
  DOWNLOAD_URL: https://mestrelab.com/downloads/mnova/mac
  SEARCH_URL: https://mestrelab.com/download/mnova/

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: "Consider switching to the MestReNova recipes in the andrewvalentine-recipes repo. This recipe is deprecated and will be removed in the future."

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: MestReNova-(?P<urlversion>(?P<version>.*?)-.*?)\.dmg
      url: "%SEARCH_URL%"

  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%/MestReNova-%urlversion%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/%NAME%.app"
      requirement: identifier "com.mestrelab.MestReNova" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = DH5EKRR34H
