Description: Downloads the latest version of MestReNova and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.MestReNova-tmp
ParentRecipe: com.github.grahampugh.recipes.download.MestReNova-tmp
MinimumVersion: 1.0.0

Input:
  NAME: MestReNova

Process:
- Processor: AppPkgCreator
