Description: Downloads the latest version of MestReNova
Identifier: com.github.grahampugh.recipes.download.MestReNova-tmp
MinimumVersion: 1.0.0

Input:
  DOWNLOAD_URL: https://mestrelab.com/downloads/mnova/mac/MestReNova-14.2.0-26256.dmg
  NAME: MestReNova

Process:
  - Arguments:
      url: "%DOWNLOAD_URL%"
    Processor: URLDownloader

  - Processor: EndOfCheckPhase
