Description: Downloads the latest version DjView.
Identifier: com.github.grahampugh.recipes.download.DjView
Input:
  NAME: DjView
  SEARCH_PATTERN: (?P<url>https://sourceforge\.net/projects/djvu/files/DjVuLibre_MacOS/(?P<dmgversion>.*?)/DjVuLibre-.*?.dmg)
  SEARCH_URL: https://sourceforge.net/projects/djvu/rss?path=/DjVuLibre_MacOS
MinimumVersion: 0.2.9
Process:
- Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    url: '%SEARCH_URL%'
  Processor: URLTextSearcher
- Arguments:
    filename: '%NAME%-%dmgversion%.dmg'
    url: '%url%'
    CHECK_FILESIZE_ONLY: true
  Processor: URLDownloader
- Processor: EndOfCheckPhase
