<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current version of SeqMonk.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.download.SeqMonk</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SeqMonk</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;match&gt;seqmonk/seqmonk_v(?P&lt;version&gt;.*?)_osx64\.dmg)</string>
				<key>url</key>
				<string>https://www.bioinformatics.babraham.ac.uk/projects/download.html</string>
				<key>user-agent</key>
				<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_4) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.1 Safari/605.1.15</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.bioinformatics.babraham.ac.uk/projects/%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
