<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SeqMonk and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.pkg.SeqMonk</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>uk.ac.babraham.seqmonk</string>
		<key>NAME</key>
		<string>SeqMonk</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.download.SeqMonk</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist</string>
				<key>output_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist</string>
				<key>plist_data</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>%BUNDLE_ID%</string>
					<key>CFBundleShortVersionString</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistEditor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
				<key>force_pkg_build</key>
				<false/>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
