Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Installs the latest version of ThinLinc Client.
Identifier: com.github.grahampugh.recipes.install.ThinLincClient
ParentRecipe: com.github.grahampugh.recipes.download.ThinLincClient
MinimumVersion: 1.0.0

Input:
  NAME: ThinLinc Client

Process:
- Processor: InstallFromDMG
  Arguments:
    dmg_path: '%pathname%'
    items_to_copy:
    - destination_path: /Applications
      source_item: ThinLinc Client.app
