Description: "Creates a package for COMSOL Multiphysics.\nThere is no download recipe since COMSOL is not publicly available.\nRequires running as: autopkg run --pkg /path/to/downloaded-comsol.dmg \"COMSOLMultiphysics.pkg\"\nYou must also override the keys COMSOL_LICENSE_SERVER, COMSOL_LICENSE_NAME, COMSOL_LICENSE_COMPANY and COMSOL_LICENSE_TYPE.\nThese values are part of your licensing setup.\n"
Identifier: com.github.grahampugh.recipes.pkg.COMSOLMultiphysics
MinimumVersion: 1.0.0

Input:
  NAME: COMSOL Multiphysics
  COMSOL_LICENSE_SERVER: 1234@example.com
  COMSOL_LICENSE_NAME: Example User
  COMSOL_LICENSE_COMPANY: EXAMPLE
  COMSOL_LICENSE_TYPE: mph

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/Scripts'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/Scripts/COMSOL.app'
    source_path: '%pathname%/*.app'

- Processor: FileCreator
  Arguments:
    file_content: "installdir =\nuninstall = 0\nshowgui = 0\nautofinish = 0\nquiet = 0\n\nagree = 1\nlicense = %COMSOL_LICENSE_SERVER%\nname = %COMSOL_LICENSE_NAME%\ncompany = %COMSOL_LICENSE_COMPANY%\nlictype = %COMSOL_LICENSE_TYPE%\n\nmatlabdir =\nproedir =\ncreopdir =\nllexcelallusers = 0\n\ndoc = selected\napplications = selected\ncad = 1\nlicmanager = 1\n\nshortcuts = 0\nsymlinks = 0\nfileassoc = 1\ncheckupdate = 0\n\nsetsecuritypolicy = 0\nsecurity.comsol.allowbatch = 1\nsecurity.comsol.allowexternalprocess = 0\nsecurity.comsol.allowmethods = 1\nsecurity.comsol.allowapplications = 1\nsecurity.external.enable = 1\nsecurity.external.propertypermission = 0\nsecurity.external.runtimepermission = 0\nsecurity.external.filepermission = limited\nsecurity.external.socketpermission = 0\nsecurity.external.netpermission = 0\nsecurity.external.reflectpermission = 0\nsecurity.external.securitypermission = 0\n"
    file_mode: '0644'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/setupconfig.ini'

- Processor: FileCreator
  Arguments:
    file_content: "#!/bin/bash\n\nDIR=$(dirname \"$0\")\n\n$DIR/COMSOL.app/Contents/Resources/setup -s $DIR/setupconfig.ini\n"
    file_mode: '0755'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/postinstall'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown: []
      id: com.comsol.pkg.comsol
      pkgname: '%NAME%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      scripts: Scripts
      version: '%version%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/Scripts'
