Comment: Recipe automatically generated from com.github.jss-recipes.jss.CarbonCopyCloner by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.CarbonCopyCloner
ParentRecipe: com.github.keeleysam.recipes.pkg.CarbonCopyCloner
MinimumVersion: "2.3"

Input:
  NAME: Carbon Copy Cloner
  GROUP_NAME: Carbon Copy Cloner-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  POLICY_NAME: "Install Latest %NAME%"
  UPDATE_PREDICATE: pkg_uploaded == False
  SELF_SERVICE_DESCRIPTION: Powerful disk cloning and backup utility.
  CATEGORY: Utility
  SELF_SERVICE_ICON: "%NAME%.png"
  SELF_SERVICE_DISPLAY_NAME: "Install Latest %NAME%"
  TESTING_GROUP_NAME: Testing
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  POLICY_CATEGORY: Testing

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      replace_group: True
      computergroup_name: "%GROUP_NAME%"
      computergroup_template: "%GROUP_TEMPLATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_name: "%POLICY_NAME%"
      icon: "%SELF_SERVICE_ICON%"
      replace_policy: True
      policy_template: "%POLICY_TEMPLATE%"
