Comment: Recipe automatically generated from com.github.jss-recipes.jss.CheatSheet by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.CheatSheet
ParentRecipe: io.github.hjuutilainen.pkg.CheatSheet
MinimumVersion: '2.3'

Input:
  NAME: CheatSheet
  CATEGORY: Utility
  GROUP_NAME: CheatSheet-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: Utility that lets you hold the command key a bit longer to get a list of all active short cuts of the current application.
  SELF_SERVICE_ICON: '%NAME%.png'
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
