Comment: Recipe automatically generated from com.github.jss-recipes.jss.GoogleVoiceandVideo by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamf.GoogleVoiceandVideo
ParentRecipe: com.github.hansen-m.pkg.GoogleVoiceAndVideo
MinimumVersion: '2.3'

Input:
  NAME: Google Voice and Video
  CATEGORY: Productivity
  GROUP_NAME: Google Voice and Video-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: A plugin for Firefox and Safari that enables you to connect to Google Hangouts and have voice and video conversations from your computer.
  SELF_SERVICE_ICON: '%NAME%.png'
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
