Description: Downloads the latest release of GLPI-Agent and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.GLPIAgent
MinimumVersion: "2.3"
ParentRecipe: com.github.grahampugh.recipes.download.GLPIAgent

Input:
  NAME: GLPI-Agent
  ARCHICTECTURE_STRING: x86_64

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%"
      pkg_path: "%RECIPE_CACHE_DIR%/GLPI-Agent-%ARCHICTECTURE_STRING%-%version%.pkg"
