Description: Creates a package of MDM Watchdog from Addigy, and installs it directly.
Identifier: com.github.grahampugh.recipes.install.MDMWatchdog
ParentRecipe: com.github.grahampugh.recipes.pkg.MDMWatchdog
MinimumVersion: "2.3"

Input:
  NAME: MDM Watchdog

Process:
  - Processor: Installer
