Description: |
  Downloads the current script of erase-install 11.
Identifier: com.github.grahampugh.recipes.download.erase-install
MinimumVersion: 1.0.0

Input:
  NAME: erase-install
  STOP_IF: download_changed == False

Process:
  - Arguments:
      asset_regex: ^erase-install-.*?.pkg$
      github_repo: grahampugh/erase-install
      include_prereleases: False
    Processor: GitHubReleasesInfoProvider

  - Processor: URLDownloader

  - Processor: EndOfCheckPhase
