Description: Downloads the latest version of erase-install and creates a package containing the script. The expectation is that this would be used with a postinstall script containing the parameters required to use this script for upgrading or reinstalling macOS on clients.
Identifier: com.github.grahampugh.recipes.pkg.erase-install
Input:
  NAME: erase-install
ParentRecipe: com.github.grahampugh.recipes.download.erase-install
MinimumVersion: 1.0.0

Process:
  - Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/erase-install-%version%.pkg"
      source_pkg: "%pathname%"
    Processor: PkgCopier
