Description: Downloads the current version of BasicTeX, a reduced distribution of MacTeX.
Identifier: com.github.grahampugh.recipes.download.BasicTeX
MinimumVersion: 0.6.0

Input:
  NAME: BasicTeX
  DOWNLOAD_URL: http://tug.org/cgi-bin/mactex-download/%NAME%.pkg
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: The full MacTeX-(?P<version>.*) install
    url: http://www.tug.org/mactex/morepackages.html

- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: true
    url: '%DOWNLOAD_URL%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Richard Koch (RBGCY5RJWM)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'

- Processor: EndOfCheckPhase
