Description: Downloads the latest version of LaTeXiT and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.LaTeXiT
ParentRecipe: com.github.grahampugh.recipes.download.LaTeXiT
MinimumVersion: 1.0.0

Input:
  NAME: LaTeXiT
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
- Processor: StopProcessingIf
  Comment: Checks if the file already exists in the cache
  Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'

- Processor: AppPkgCreator
  Arguments:
    force_pkg_build: true
