Description: Downloads the latest version of MathType.
Identifier: com.github.grahampugh.download.MathType
MinimumVersion: 1.0.0

Input:
  STOPPROCESSINGIF_PREDICATE: FALSEPREDICATE
  DOWNLOAD_URL: https://store.wiris.com/en/products/downloads/mathtype/installer/mac/en

Process:
- Processor: URLDownloader
  Arguments:
    filename: MathType-mac-en.pkg
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Design Science, Inc. (HNQ4485Q28)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
