Description: |
    Takes the downloaded COMSOL Multiphysics installer and creates an installable package.
    No download recipe is provided in this public repo.
    The setupconfig.ini is required, and needs to be configured for each organisation.
Identifier: com.github.grahampugh.recipes.pkg.COMSOL
Input:
  NAME: COMSOL Multiphysics
  LIST_NAME: Comsol Multiphysics
  LANGUAGE: ML
MinimumVersion: 1.0.0
ParentRecipe: NEEDS-OWN-DOWNLOAD-RECIPE
Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/Scripts'
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Library: '0775'
      Library/Management: '0775'
      Library/Management/COMSOL: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
- Processor: Copier
  Arguments:
    source_path: '%pathname%/*.app'
    destination_path: '%RECIPE_CACHE_DIR%/pkgroot/Library/Management/COMSOL/COMSOL.app'
- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/pkgroot/Library/Management/COMSOL/setupconfig.ini'
    source_path: '%RECIPE_DIR%/setupconfig.ini'
- Processor: FileCreator
  Arguments:
    file_path: '%RECIPE_CACHE_DIR%/Scripts/postinstall'
    file_mode: '0755'
    file_content: |
        #!/bin/bash

        /Library/Management/COMSOL/COMSOL.app/Contents/Resources/setup -s /Library/Management/COMSOL/setupconfig.ini

        rm -rf /Library/Management/COMSOL
- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown: []
      id: ch.ethz.id.pkg.comsol
      pkgname: '%NAME%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      scripts: Scripts
      version: '%version%'
