Description: |
  Creates a package for COMSOL Multiphysics.
  There is no download recipe since COMSOL is not publicly available.
  Requires running as: autopkg run --pkg /path/to/downloaded-comsol.dmg "COMSOLMultiphysics.pkg"
  You must also override the keys COMSOL_LICENSE_SERVER, COMSOL_LICENSE_NAME, COMSOL_LICENSE_COMPANY and COMSOL_LICENSE_TYPE.
  These values are part of your licensing setup.
Identifier: com.github.grahampugh.recipes.pkg.COMSOLMultiphysics
MinimumVersion: "2.3"

Input:
  NAME: COMSOL Multiphysics
  COMSOL_LICENSE_COMPANY: EXAMPLE
  COMSOL_LICENSE_NAME: Example User
  COMSOL_LICENSE_SERVER: 1234@example.com
  COMSOL_LICENSE_TYPE: mph

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/Scripts"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: Copier
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/Scripts/COMSOL.app"
      source_path: "%pathname%/*.app"

  - Processor: FileCreator
    Arguments:
      file_content: |
        installdir =
        uninstall = 0
        showgui = 0
        autofinish = 0
        quiet = 0

        agree = 1
        license = %COMSOL_LICENSE_SERVER%
        name = %COMSOL_LICENSE_NAME%
        company = %COMSOL_LICENSE_COMPANY%
        lictype = %COMSOL_LICENSE_TYPE%

        matlabdir =
        proedir =
        creopdir =
        llexcelallusers = 0

        doc = selected
        applications = selected
        cad = 1
        licmanager = 1

        shortcuts = 0
        symlinks = 0
        fileassoc = 1
        checkupdate = 0

        setsecuritypolicy = 0
        security.comsol.allowbatch = 1
        security.comsol.allowexternalprocess = 0
        security.comsol.allowmethods = 1
        security.comsol.allowapplications = 1
        security.external.enable = 1
        security.external.propertypermission = 0
        security.external.runtimepermission = 0
        security.external.filepermission = limited
        security.external.socketpermission = 0
        security.external.netpermission = 0
        security.external.reflectpermission = 0
        security.external.securitypermission = 0
      file_mode: "0644"
      file_path: "%RECIPE_CACHE_DIR%/Scripts/setupconfig.ini"

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/bash

        DIR=$(dirname "$0")

        $DIR/COMSOL.app/Contents/Resources/setup -s $DIR/setupconfig.ini
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: com.comsol.pkg.comsol
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/Scripts"
