Description: Downloads the latest version of Adobe Creative Cloud Cleaner and makes a pkg of it then uploads it to the JSS. the postinstall script runs the cleaner, which removes all Adobe CC apps from a client. The app is also moved to the Utilities folder so that it can be used subsequently, but is not obvious to the user.
Identifier: com.github.grahampugh.recipes.jss-triggeronly.AdobeCCCleaner
ParentRecipe: com.github.blackthroat.pkg.AdobeCreativeCloudCleanerTool
MinimumVersion: 1.0.0

Input:
  NAME: Adobe Creative Cloud Cleaner Tool
  CATEGORY: Triggered Installers
  POLICY_CATEGORY: Untested
  POLICY_TEMPLATE: PolicyTemplate-triggeronly.xml
  POSTINSTALL_SCRIPT: Adobe CC Cleaner-postinstall.sh
  POSTINSTALL_SCRIPT_TEMPLATE: Adobe CC Cleaner-postinstall-ScriptTemplate.xml
  PROD_NAME: '%NAME%'
  TRIGGER_NAME: Run-AdobeCCCleaner

Process:
- Processor: JSSImporter
  Arguments:
    category: '%CATEGORY%'
    pkg_path: '%pkg_path%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%PROD_NAME%'
    scripts:
    - name: '%POSTINSTALL_SCRIPT%'
      template_path: '%POSTINSTALL_SCRIPT_TEMPLATE%'
