Description: Installs the latest version of Backup And sync from Google. Note that the non-localized name for the app is 'Backup and Sync.app'
Identifier: com.github.grahampugh.install.GoogleBackupAndSync
ParentRecipe: com.github.nstrauss.download.BackupandSync
MinimumVersion: "2.3"

Input:
  NAME: BackupandSync

Process:
  - Processor: InstallFromDMG
    Arguments:
      dmg_path: "%pathname%"
      items_to_copy:
        - destination_path: /Applications
          source_item: Backup and Sync.app
