Description: Downloads the latest version of Riot and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.Element
ParentRecipe: com.github.grahampugh.recipes.download.Element
MinimumVersion: 1.0.0

Input:
  NAME: Element
  BUNDLE_ID: im.riot.app

Process:
- Processor: AppPkgCreator
  Arguments:
    force_pkg_build: true
    pkg_path: '%RECIPE_CACHE_DIR%/Element-%version%.pkg'
