Description: Installs Jamf Compliance Editor to the user's Applications directory. Note that the Applications directory must be created before running this recipe.
Identifier: com.github.grahampugh.recipes.userinstall.JamfComplianceEditor
ParentRecipe: com.github.grahampugh.recipes.download.JamfComplianceEditor
MinimumVersion: "2.3"

Input:
  NAME: Jamf Compliance Editor

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/GetUserHome

  - Processor: com.github.grahampugh.recipes.commonprocessors/InstallFromFolder
    Arguments:
      source_directory: "%RECIPE_CACHE_DIR%/unzip"
      items_to_copy:
        - destination_path: "%user_home%/Applications"
          source_item: "%NAME%.app"
          user: "%current_user%"
          group: staff
          mode: "0755"
