Description: Installs Notion to the user's Applications directory. Note that the Applications directory must be created before running this recipe. The default download is the AMD64 version. To download the ARM version, set ARCH to arm64
Identifier: com.github.grahampugh.recipes.userinstall.SparkDesktop
ParentRecipe: com.github.grahampugh.recipes.download.SparkDesktop
MinimumVersion: "2.3"

Input:
  NAME: Spark Desktop

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/GetUserHome

  - Processor: InstallFromDMG
    Arguments:
      dmg_path: "%RECIPE_CACHE_DIR%/downloads/Spark.dmg"
      items_to_copy:
        - destination_path: "%user_home%/Applications"
          source_item: Spark Desktop.app
          user: "%current_user%"
          group: staff
          mode: "0755"
