Description: Downloads the current release of JSSImporter from Github.
Identifier: com.github.grahampugh.download.JSSImporterBeta
Input:
  NAME: JSSImporter
MinimumVersion: 0.6.0
Process:
- Arguments:
    github_repo: jssimporter/JSSImporter
    include_prereleases: True
  Processor: GitHubReleasesInfoProvider
- Arguments:
    filename: '%NAME%.pkg'
  Processor: URLDownloader
- Processor: EndOfCheckPhase
