Description: Downloads the latest EndNote updates and unzips the contents.
Identifier: com.github.grahampugh.recipes.download.EndNoteUpdates
Input:
  NAME: EndNote
  MAJOR_VERSION: 'X9'
  INT_VERSION: '19'
  version: latest
MinimumVersion: 0.5.0
Process:
- Arguments:
    re_pattern: (/updates/%INT_VERSION%.0/EndNote%MAJOR_VERSION%[0-9]*UpdateInstaller.zip)
    url: http://download.endnote.com/updates/%INT_VERSION%.0/EN%INT_VERSION%MacUpdates.xml
  Processor: URLTextSearcher
- Arguments:
    filename: '%NAME%.zip'
    url: http://download.endnote.com%match%
  Processor: URLDownloader
- Processor: EndOfCheckPhase
- Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%-%MAJOR_VERSION%'
    purge_destination: true
  Processor: Unarchiver
- Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%-%MAJOR_VERSION%/*/*.app'
    requirement: anchor trusted
  Processor: CodeSignatureVerifier
- Arguments:
    re_pattern: (updateTo\>(?P<version>.*?)\<\/updateTo)
    url: http://download.endnote.com/updates/%INT_VERSION%.0/EN%INT_VERSION%MacUpdates.xml
  Processor: URLTextSearcher
