Description: Downloads the current release version of AdoptOpenJDK 12 OpenJ9. Recipe created by Charles Mission.
Identifier: com.github.grahampugh.recipes.download.AdoptOpenJDK12_OpenJ9_Signed
MinimumVersion: 1.0.0

Input:
  NAME: AdoptOpenJDK 12 OpenJ9
  STOPPROCESSINGIF_PREDICATE: download_changed == False

Process:
- Arguments:
    re_pattern: (?P<match>AdoptOpenJDK\/openjdk12-binaries\/releases\/download\/jdk12.*?\/OpenJDK12U-jdk_x64_mac_openj9_.*?\.pkg)
    url: https://github.com/AdoptOpenJDK/openjdk12-binaries/releases
  Processor: URLTextSearcher

- Arguments:
    url: 'https://github.com/%match%'
  Processor: URLDownloader

- Processor: EndOfCheckPhase

- Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'
  Comment: Checks if the file already exists in the cache
  Processor: StopProcessingIf

- Arguments:
    expected_authority_names:
    - 'Developer ID Installer: London Jamocha Community CIC (VDX7B37674)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
  Processor: CodeSignatureVerifier
