Description: Downloads the current release version of AdoptOpenJDK 11 and builds a package. This is based from the tar version rather than the signed pkg version, so that the true version number can be obtained.
Identifier: com.github.grahampugh.recipes.pkg.AdoptOpenJDK11
ParentRecipe: com.github.grahampugh.recipes.download.AdoptOpenJDK11
MinimumVersion: 1.0.0

Input:
  NAME: AdoptOpenJDK 11

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Library: '0755'
      Library/Java: '0755'
      Library/Java/JavaVirtualMachines: '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%pkgroot%/Library/Java/JavaVirtualMachines'
    purge_destination: true

- Processor: FileFinder
  Arguments:
    pattern: '%pkgroot%/Library/Java/JavaVirtualMachines/jdk-11*/Contents/Info.plist'

- Processor: Versioner
  Arguments:
    input_plist_path: '%found_filename%'
    plist_version_key: CFBundleVersion

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: wheel
        path: Library
        user: root
      - group: wheel
        path: Library/Java
        user: root
      - group: wheel
        path: Library/Java/JavaVirtualMachines
        user: root
      id: com.AdoptOpenJDK-11.jdk
      options: purge_ds_store
      pkgname: AdoptOpenJDK11-%version%
      version: '%version%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/pkgroot'
