Description: Downloads the current release version of AdoptOpenJDK 12 HotSpot. Recipe created by Charles Mission.
Identifier: com.github.grahampugh.recipes.download.AdoptOpenJDK12_Signed
MinimumVersion: 1.0.0

Input:
  NAME: AdoptOpenJDK 12
  STOPPROCESSINGIF_PREDICATE: download_changed == False

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: (?P<match>AdoptOpenJDK\/openjdk12-binaries\/releases\/download\/jdk12.*?\/OpenJDK12U-jdk_x64_mac_hotspot_.*?\.pkg)
    url: https://github.com/AdoptOpenJDK/openjdk12-binaries/releases

- Processor: URLDownloader
  Arguments:
    url: https://github.com/%match%

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Comment: Checks if the file already exists in the cache
  Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: London Jamocha Community CIC (VDX7B37674)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
