Description: |
  Downloads the current release version of AdoptOpenJDK 11. This is the signed pkg version rather 
  than the tar version, for those that require a signed package rather than accurate version number.
  
  The default JVM implementation is "hotspot". To override to "openj9", change the value of JVM_IMPLEMENTATION.
  
  The default Release Type is "releases", which is the stable build. To get the most recent build, select "nightly".
Identifier: com.github.grahampugh.recipes.download.AdoptOpenJDK11_Signed
MinimumVersion: 1.0.0

Input:
  NAME: AdoptOpenJDK 11
  JVM_IMPLEMENTATION: hotspot
  RELEASE_STREAM: releases
  STOPPROCESSINGIF_PREDICATE: download_changed == False

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: installer_link.*?(?P<match>AdoptOpenJDK.*?\/OpenJDK11U-jdk_x64_mac_%JVM_IMPLEMENTATION%_.*?\.pkg)
    url: https://api.adoptopenjdk.net/v2/latestAssets/%RELEASE_STREAM%/openjdk11?os=mac&arch=x64&heap_size=normal&openjdk_impl=%JVM_IMPLEMENTATION%&type=jdk

- Processor: URLDownloader
  Arguments:
    url: https://github.com/%match%

- Processor: EndOfCheckPhase

- Processor: StopProcessingIf
  Comment: Checks if the file already exists in the cache
  Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: London Jamocha Community CIC (VDX7B37674)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
