Description: |
  Downloads the current release version of AdoptOpenJDK 8. This is based from the tar version rather 
  than the signed pkg version, so that the true version number can be obtained.

  The default JVM implementation is "hotspot". To override to "openj9", change the value of JVM_IMPLEMENTATION.

  The default Release Type is "releases", which is the stable build. To get the most recent build, select "nightly".

Identifier: com.github.grahampugh.recipes.download.AdoptOpenJDK8
MinimumVersion: 1.0.0

Input:
  NAME: AdoptOpenJDK 8
  RELEASE_STREAM: releases
  JVM_IMPLEMENTATION: hotspot

Process:
  - Arguments:
      re_pattern: binary_link.*?(?P<match>AdoptOpenJDK.*?\/OpenJDK8U-jdk_x64_mac_%JVM_IMPLEMENTATION%_.*?\.tar\.gz)
      url: https://api.adoptopenjdk.net/v2/latestAssets/%RELEASE_STREAM%/openjdk8?os=mac&arch=x64&heap_size=normal&openjdk_impl=%JVM_IMPLEMENTATION%&type=jdk
    Processor: URLTextSearcher

  - Arguments:
      url: "https://github.com/%match%"
    Processor: URLDownloader

  - Processor: EndOfCheckPhase
