Description: Downloads the current release version of AdoptOpenJDK 8 OpenJ9. Recipe created by Charles Mission.
Identifier: com.github.grahampugh.recipes.munki.AdoptOpenJDK8_OpenJ9_Signed
ParentRecipe: com.github.grahampugh.recipes.download.AdoptOpenJDK8_OpenJ9_Signed

Input:
  pkginfo:
    catalogs:
    - testing
    category: Developer Tools
    description: AdoptOpenJDK 8 OpenJ9
    developer: AdoptOpenJDK
    name: AdoptOpenJDK 8 OpenJ9
    unattended_install: true
    unattended_uninstall: true
    uninstall_method: removepackages
  MUNKI_REPO_SUBDIR: apps/AdoptOpenJDK/8/

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
