Description: Downloads the current release version of AdoptOpenJDK 13 HotSpot. Recipe created by Charles Mission.
Identifier: com.github.grahampugh.recipes.munki.AdoptOpenJDK13_Signed
Input:
  MUNKI_REPO_SUBDIR: apps/AdoptOpenJDK/13/
  pkginfo:
    catalogs:
    - testing
    category: Developer Tools
    description: AdoptOpenJDK 13 HotSpot
    developer: AdoptOpenJDK
    name: AdoptOpenJDK 13
    unattended_install: true
    unattended_uninstall: true
    uninstall_method: removepackages
ParentRecipe: com.github.grahampugh.recipes.download.AdoptOpenJDK13_Signed
Process:
- Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
  Processor: MunkiImporter
