<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.jamf.CiscoAnyConnect-uninstall</string>
	<key>Input</key>
	<dict>
		<key>GROUP_NAME</key>
		<string>%NAME%-uninstall</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroup-uninstall-self-service.xml</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Uninstall</string>
		<key>NAME</key>
		<string>Cisco AnyConnect Secure Mobility Client</string>
		<key>POLICY_CATEGORY</key>
		<string>Uninstallers</string>
		<key>POLICY_NAME</key>
		<string>Uninstall %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-uninstall-self-service.xml</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Uninstall</string>
		<key>SCRIPT_NAME</key>
		<string>CiscoAnyConnect-uninstall.sh</string>
		<key>SCRIPT_PRIORITY</key>
		<string>After</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Uninstalls Cisco AnyConnect. Please note that with macOS Big Sur and above, an administrator account password must be provided via a prompt in order to remove the System Extension that comes with Cisco AnyConnect.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Uninstall %NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Cisco AnyConnect.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>replace_group</key>
		<string>False</string>
		<key>replace_policy</key>
		<string>True</string>
		<key>replace_script</key>
		<string>True</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%POLICY_CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>script_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>script_path</key>
				<string>%SCRIPT_NAME%</string>
				<key>script_priority</key>
				<string>%SCRIPT_PRIORITY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfScriptUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%GROUP_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
