Description: Downloads the latest version of dupeGuru and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.dupeGuru
ParentRecipe: com.github.grahampugh.recipes.download.dupeGuru
MinimumVersion: "2.3"

Input:
  NAME: dupeGuru

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: AppPkgCreator
    Arguments:
      force_pkg_build: false
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
