Description: Uploads the erase-install pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group. A run command is added to the policy which will reinstall macOS the volume.
Identifier: com.github.grahampugh.recipes.jss.download-macos-catalina
ParentRecipe: com.github.grahampugh.recipes.pkg.erase-install
MinimumVersion: 1.0.0

Input:
  NAME: Download macOS Catalina
  CATEGORY: Administration
  GROUP_NAME: '%NAME% test users'
  GROUP_TEMPLATE: '%NAME%-SmartGroupTemplate.xml'
  POLICY_CATEGORY: Untested
  POLICY_TEMPLATE: '%NAME%-PolicyTemplate.xml'
  PROD_NAME: '%NAME%'
  RUN_COMMAND: /Library/Management/erase-install/erase-install.sh --os=10.15 --overwrite
  SELF_SERVICE_DESCRIPTION: Downloads the currently available 'Install macOS Catalina' application to the Applications folder. It will replace any existing version of the application.
  SELF_SERVICE_ICON: Install macOS Catalina.png
  SELF_SERVICE_INSTALL_BUTTON: Download
  SELF_SERVICE_REINSTALL_BUTTON: Download

Process:
- Processor: JSSImporter
  Arguments:
    category: '%CATEGORY%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    pkg_path: '%pkg_path%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%PROD_NAME%'
    self_service_description: '%SELF_SERVICE_DESCRIPTION%'
    self_service_icon: '%SELF_SERVICE_ICON%'
    version: '%version%'
