Comment: Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)
Description: Installs the latest version of LineIn.
Identifier: com.github.grahampugh.install.LineIn
ParentRecipe: com.github.grahampugh.download.LineIn
MinimumVersion: "2.3"

Input:
  NAME: LineIn

Process:
  - Processor: DmgCreator
    Arguments:
      dmg_path: "%RECIPE_CACHE_DIR%/%NAME%.dmg"
      dmg_root: "%RECIPE_CACHE_DIR%/%NAME%/Applications"

  - Processor: InstallFromDMG
    Arguments:
      dmg_path: "%dmg_path%"
      items_to_copy:
        - destination_path: /Applications
          source_item: "%NAME%.app"
