<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.pkg.LogitechPresentation</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Logitech Presentation</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.download.LogitechPresentation</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Library</key>
					<string>0775</string>
					<key>Library/Application Support</key>
					<string>0775</string>
					<key>Library/Application Support/Logitech.localized</key>
					<string>0775</string>
					<key>Library/Application Support/Logitech.localized/Logitech Presentation.localized</key>
					<string>0775</string>
					<key>Library/LaunchAgents</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Library/Application Support/Logitech.localized/Logitech Presentation.localized/Logitech Presentation.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/LogiPresentation Installer.app/Contents/Resources/LogiPresentation Main Installer.app/Contents/Resources/Logitech.localized/Logitech Presentation.localized/Logitech Presentation.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Library/Application Support/Logitech.localized/Logitech Presentation.localized/LogiPresentationUpdater.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/LogiPresentation Installer.app/Contents/Resources/LogiPresentation Main Installer.app/Contents/Resources/Logitech.localized/Logitech Presentation.localized/LogiPresentationUpdater.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Library/Application Support/Logitech.localized/Logitech Presentation.localized/Onboarding.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/LogiPresentation Installer.app/Contents/Resources/LogiPresentation Main Installer.app/Contents/Resources/Logitech.localized/Logitech Presentation.localized/Onboarding.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"&gt;
&lt;plist version="1.0"&gt;
&lt;dict&gt;
    &lt;key&gt;Disabled&lt;/key&gt;
    &lt;false/&gt;
    &lt;key&gt;KeepAlive&lt;/key&gt;
    &lt;false/&gt;
    &lt;key&gt;Label&lt;/key&gt;
    &lt;string&gt;com.logitech.presenter&lt;/string&gt;
    &lt;key&gt;LimitLoadToSessionType&lt;/key&gt;
    &lt;string&gt;Aqua&lt;/string&gt;
    &lt;key&gt;Nice&lt;/key&gt;
    &lt;integer&gt;0&lt;/integer&gt;
    &lt;key&gt;ProgramArguments&lt;/key&gt;
    &lt;array&gt;
        &lt;string&gt;/Library/Application Support/Logitech.localized/Logitech Presentation.localized/Logitech Presentation.app/Contents/MacOS/Logitech Presentation&lt;/string&gt;
        &lt;string&gt;--launchd&lt;/string&gt;
    &lt;/array&gt;
    &lt;key&gt;RunAtLoad&lt;/key&gt;
    &lt;true/&gt;
&lt;/dict&gt;
&lt;/plist&gt;
</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/com.logitech.presenter.plist</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash

DIR=$(dirname "$0")

# put the LaunchAgent into place
/bin/cp "$DIR/com.logitech.presenter.plist" "/Library/LaunchAgents/com.logitech.presenter.plist"
/usr/sbin/chown root:wheel "/Library/LaunchAgents/com.logitech.presenter.plist"
/bin/chmod 644 "/Library/LaunchAgents/com.logitech.presenter.plist"

# make a shortcut to the Presentation app
/bin/ln -s "/Library/Application Support/Logitech.localized/Logitech Presentation.localized/Logitech Presentation.app" "/Applications/Logitech Presentation"
</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
					</array>
					<key>id</key>
					<string>com.logitech.logipresentation.pkg</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
				</dict>
				<key>pkgname</key>
				<string>%NAME%-%version%</string>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
