Description: Downloads the current version of LogitechPresentation.
Identifier: com.github.grahampugh.recipes.download.LogitechPresentation
MinimumVersion: "2.3"

Input:
  NAME: Logitech Presentation

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: macOS.*?(https://download01\.logi\.com/web/ftp/pub/techsupport/presentation/LogiPresentation_.*?\.dmg)\\\"
      url: https://support.logi.com/api/v2/help_center/en-gb/articles.json?label_names=webcontent=productdownload,webproduct=f7f7f812-7db0-11e9-b911-cb2c3611cd40

  - Processor: URLDownloader
    Arguments:
      url: "%match%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/LogiPresentation Installer.app"
      requirement: identifier "com.logitech.presenter.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QED4VVPZWA
