Identifier: com.github.grahampugh.recipes.pkg.LogitechPresentation
ParentRecipe: com.github.grahampugh.recipes.download.LogitechPresentation
MinimumVersion: "2.3"

Input:
  NAME: Logitech Presentation

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/Scripts"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
        Library: "0775"
        Library/Application Support: "0775"
        Library/Application Support/Logitech.localized: "0775"
        Library/Application Support/Logitech.localized/Logitech Presentation.localized: "0775"
        Library/LaunchAgents: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Library/Application Support/Logitech.localized/Logitech Presentation.localized/Logitech Presentation.app"
      overwrite: true
      source_path: "%pathname%/LogiPresentation Installer.app/Contents/Resources/LogiPresentation Main Installer.app/Contents/Resources/Logitech.localized/Logitech Presentation.localized/Logitech Presentation.app"

  - Processor: PlistReader
    Arguments:
      info_path: "%pkgroot%/Library/Application Support/Logitech.localized/Logitech Presentation.localized/Logitech Presentation.app/Contents/Info.plist"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Library/Application Support/Logitech.localized/Logitech Presentation.localized/LogiPresentationUpdater.app"
      overwrite: true
      source_path: "%pathname%/LogiPresentation Installer.app/Contents/Resources/LogiPresentation Main Installer.app/Contents/Resources/Logitech.localized/Logitech Presentation.localized/LogiPresentationUpdater.app"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Library/Application Support/Logitech.localized/Logitech Presentation.localized/Onboarding.app"
      overwrite: true
      source_path: "%pathname%/LogiPresentation Installer.app/Contents/Resources/LogiPresentation Main Installer.app/Contents/Resources/Logitech.localized/Logitech Presentation.localized/Onboarding.app"

  - Processor: FileCreator
    Arguments:
      file_content: |
        <?xml version="1.0" encoding="UTF-8"?>
        <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
        <plist version="1.0">
        <dict>
            <key>Disabled</key>
            <false/>
            <key>KeepAlive</key>
            <false/>
            <key>Label</key>
            <string>com.logitech.presenter</string>
            <key>LimitLoadToSessionType</key>
            <string>Aqua</string>
            <key>Nice</key>
            <integer>0</integer>
            <key>ProgramArguments</key>
            <array>
                <string>/Library/Application Support/Logitech.localized/Logitech Presentation.localized/Logitech Presentation.app/Contents/MacOS/Logitech Presentation</string>
                <string>--launchd</string>
            </array>
            <key>RunAtLoad</key>
            <true/>
        </dict>
        </plist>
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/Scripts/com.logitech.presenter.plist"

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/bash

        DIR=$(dirname "$0")

        # put the LaunchAgent into place
        /bin/cp "$DIR/com.logitech.presenter.plist" "/Library/LaunchAgents/com.logitech.presenter.plist"
        /usr/sbin/chown root:wheel "/Library/LaunchAgents/com.logitech.presenter.plist"
        /bin/chmod 644 "/Library/LaunchAgents/com.logitech.presenter.plist"

        # make a shortcut to the Presentation app
        /bin/ln -s "/Library/Application Support/Logitech.localized/Logitech Presentation.localized/Logitech Presentation.app" "/Applications/Logitech Presentation"
      file_mode: "0755"
      file_path: "%RECIPE_CACHE_DIR%/Scripts/postinstall"

  - Processor: PkgCreator
    Arguments:
      force_pkg_build: false
      pkg_request:
        chown: []
        id: com.logitech.logipresentation.pkg
        options: purge_ds_store
        pkgdir: "%RECIPE_CACHE_DIR%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        pkgtype: flat
        scripts: Scripts
      pkgname: "%NAME%-%version%"
