<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Checks folder on locally mounted repo for update. Requires override of LIST_NAME and LOCAL_REPO.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.download.MOE</string>
	<key>Input</key>
	<dict>
		<key>EXCEPTION</key>
		<string></string>
		<key>LIST_NAME</key>
		<string>ChemComp_MOE</string>
		<key>LOCAL_REPO</key>
		<string>/Volumes/Packaging/mac-resources</string>
		<key>VENDOR</key>
		<string>Chemical_Computing_Group</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>EXCEPTION</key>
				<string>%EXCEPTION%</string>
				<key>root_path</key>
				<string>%LOCAL_REPO%/%VENDOR%/%NAME%</string>
			</dict>
			<key>Comment</key>
			<string>Get list of folder contents. Outputs found_directories and found_filenames.</string>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/SubDirectoryList</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>RECIPE_CACHE_DIR</key>
				<string>%RECIPE_CACHE_DIR%</string>
				<key>found_files</key>
				<string>%found_filenames%</string>
			</dict>
			<key>Comment</key>
			<string>Gets the latest version of a file and its containing folder. Outputs latest_file, version</string>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/LocalRepoUpdateChecker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>file_exists == True</string>
			</dict>
			<key>Comment</key>
			<string>Checks if the file already exists in the cache</string>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>file://%root_path%/%version%/%latest_file%.dmg</string>
			</dict>
			<key>Comment</key>
			<string>Downloads the file from the source repo to the AutoPkg cache</string>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
