<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates an installable package for ChemComp MOE.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.pkg.MOE</string>
	<key>Input</key>
	<dict>
		<key>EXCEPTION</key>
		<string></string>
		<key>LOCAL_REPO</key>
		<string>/Volumes/Packaging/mac-resources</string>
		<key>NAME</key>
		<string>ChemComp_MOE</string>
		<key>VENDOR</key>
		<string>Chemical_Computing_Group</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.download.MOE</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/moe%version%_installer.app</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%latest_file%.dmg/moe%version%_installer.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash
## script to install MOE

DIR=$(dirname "$0")

# function to run the MOE Installer Package with command line tools

$DIR/moe%version%_installer.app/Contents/MacOS/moe%version%_installer -r installer.properties

if [[ $? == 0 || $? == 1 ]]; then
    exit 0
else
    exit 1
fi
</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>INSTALLER_UI=SILENT
USER_INSTALL_DIR=/Applications
</string>
				<key>file_mode</key>
				<string>0644</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/installer.properties</string>
			</dict>
			<key>Processor</key>
			<string>FileCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/moe%version%_installer.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>moeVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>force_pkg_build</key>
				<true/>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
					</array>
					<key>id</key>
					<string>com.chemcomp.pkg.moe</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
