<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of 1Password and builds a package. Then, uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.grahampugh.recipes.jamf.1Password</string>
        <key>Input</key>
        <dict>
            <key>CATEGORY</key>
            <string>Utility</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>SmartGroupTemplate.xml</string>
            <key>NAME</key>
            <string>1Password</string>
            <key>OS_REQUIREMENTS</key>
            <string>11.x,10.16.x,10.15.x,10.14.x,10.13.x</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_NAME</key>
            <string>Install Latest %NAME%</string>
            <key>POLICY_TEMPLATE</key>
            <string>JamfPolicyTemplate.xml</string>
            <key>SELF_SERVICE_DESCRIPTION</key>
            <string>1Password for Mac lets you keep all of your log-ins in one place, so you'll never have to worry about forgetting passwords again. And all of the information you enter into this app is protected by a master password, which means you won't have to worry about unauthorized access, either.</string>
            <key>SELF_SERVICE_ICON</key>
            <string>1Password.png</string>
            <key>UPDATE_PREDICATE</key>
            <string>pkg_uploaded == False</string>
        </dict>
        <key>MinimumVersion</key>
        <string>2.3</string>
        <key>ParentRecipe</key>
        <string>io.github.hjuutilainen.pkg.1Password</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>category_name</key>
                    <string>%CATEGORY%</string>
                </dict>
                <key>Processor</key>
                <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>os_requirements</key>
                    <string>%OS_REQUIREMENTS%</string>
                </dict>
                <key>Processor</key>
                <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>predicate</key>
                    <string>%UPDATE_PREDICATE%</string>
                </dict>
                <key>Processor</key>
                <string>StopProcessingIf</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>computergroup_name</key>
                    <string>%GROUP_NAME%</string>
                    <key>computergroup_template</key>
                    <string>%GROUP_TEMPLATE%</string>
                </dict>
                <key>Processor</key>
                <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                    <key>policy_name</key>
                    <string>%POLICY_NAME%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                </dict>
                <key>Processor</key>
                <string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
            </dict>
        </array>
    </dict>
</plist>
