Description: Provides the version of Apple Java SE 6 Runtime for OS X, and copies the downloaded pkg so that it includes the version number.
Identifier: com.github.grahampugh.recipes.pkg.AppleJava6
ParentRecipe: com.github.n8felton.download.AppleJava6
MinimumVersion: 0.4.0

Input:
  NAME: AppleJava6

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pathname%/JavaForOSX.pkg'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      pkgroot: '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/unpack/root'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack/root'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/JavaForOSX.pkg/Payload'

- Processor: Java6Versioner
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/unpack/root/Library/Java/JavaVirtualMachines/1.6.0.jdk/Contents/Info.plist'

- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/Java_SE_6_Runtime_%version%.pkg'
    source_pkg: '%pathname%/JavaForOSX.pkg'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
