Description: Downloads the current version of FoldingAtHome.
Identifier: com.github.grahampugh.recipes.download.FoldingAtHome
MinimumVersion: "2.3"

Input:
  NAME: Folding@Home

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<urlpath>macos-\d+-universal/release/fah-client_(?P<version>[\d\.]+)_universal\.pkg)
      url: https://download.foldingathome.org/releases/public/fah-client/meta.json

  - Processor: URLDownloader
    Arguments:
      url: "https://download.foldingathome.org/releases/public/fah-client/%urlpath%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: Cauldron Development Oy (M9MP6KCS4V)"
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: "%pathname%"
