Description: Downloads the latest version of FoldingAtHome, works out the version number and copies the package.
Identifier: com.github.grahampugh.recipes.pkg.FoldingAtHome
ParentRecipe: com.github.grahampugh.recipes.download.FoldingAtHome
MinimumVersion: "2.3"

Input:
  Name: Folding@Home

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/FoldingAtHome-%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/unzip/fah-installer_%version%_x86_64.pkg"
