Description: Creates a package of the Prism app, renaming the app so it doesn't have the version number in it. Requires a local download recipe.
Identifier: com.github.grahampugh.recipes.pkg.Prism
Input:
  LIST_NAME: Prism
  NAME: Prism
MinimumVersion: 1.0.0
ParentRecipe: NEEDS-OWN-DOWNLOAD-RECIPE
Process:
- Processor: Copier
  Arguments:
    source_path: '%pathname%/Prism*.app'
    destination_path: '%RECIPE_CACHE_DIR%/Prism.app'
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/Prism.app'
    pathname: '%RECIPE_CACHE_DIR%/%latest_file%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/Prism.app'
