Description: Downloads the latest version of KNIME and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.KNIME
ParentRecipe: com.github.grahampugh.download.KNIME
MinimumVersion: 1.0.0

Input:
  NAME: KNIME
  BUNDLE_ID: org.knime.product

Process:
- Processor: AppPkgCreator
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
