Description: "Creates a package for ChemDraw.\nThere is no download recipe since ChemDraw is not publicly available.\nRequires running as: autopkg run --pkg /path/to/downloaded-chemdraw.dmg ChemDraw.pkg\nOnly works with ChemDraw 18+ as the name has changed - before it was \"ChemDraw Professional\"\n"
Identifier: com.github.grahampugh.recipes.pkg.ChemDraw
MinimumVersion: 1.0.0

Input:
  NAME: ChemDraw
  MAJOR_VERSION: '18'

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
      Library: '0775'
      Library/QuickLook: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/pkgroot/Library/QuickLook/CDQuickLook.qlgenerator'
    overwrite: true
    source_path: '%pathname%/CDQuickLook.qlgenerator'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/pkgroot/Applications/ChemDraw %MAJOR_VERSION%.0.app'
    overwrite: true
    source_path: '%pathname%/ChemDraw*.app'

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/pkgroot/Applications/ChemDraw %MAJOR_VERSION%.0.app/Contents/Info.plist'

- Processor: PkgCreator
  Arguments:
    force_pkg_build: true
    pkg_request:
      chown: []
      id: com.chemdraw.pkg.ChemDraw%MAJOR_VERSION%
      pkgname: '%NAME%-%MAJOR_VERSION%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      version: '%version%'
