Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Installs the latest version of CotEditor.
Identifier: com.github.grahampugh.install.CotEditor
ParentRecipe: com.github.grahampugh.download.CotEditor
MinimumVersion: "2.3"

Input:
  NAME: CotEditor

Process:
  - Processor: InstallFromDMG
    Arguments:
      dmg_path: "%pathname%"
      items_to_copy:
        - destination_path: /Applications
          source_item: CotEditor.app
