Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of CotEditor and imports it into Munki.
Identifier: com.github.grahampugh.munki.CotEditor
ParentRecipe: com.github.grahampugh.download.CotEditor
MinimumVersion: "2.3"

Input:
  NAME: CotEditor
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
      - testing
    description: Lightweight Plain-Text Editor for macOS
    developer: Kosuke USAMI
    display_name: CotEditor
    name: "%NAME%"
    unattended_install: true

Process:
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pathname%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"
