Description: |
  Downloads the current script of homebrew.sh.
Identifier: com.github.grahampugh.recipes.download.homebrew-install
MinimumVersion: 1.0.0

Input:
  NAME: homebrew-install

Process:
  - Arguments:
      url: https://github.com/Honestpuck/homebrew.sh
      re_pattern: (?P<url>\/Honestpuck\/homebrew\.sh\/blob\/master\/(?P<script_name>homebrew-(?P<version>.*?)\.sh))
    Processor: URLTextSearcher

  - Processor: URLDownloader
    Arguments:
      url: "https://github.com/%url%"

  - Processor: EndOfCheckPhase
