Description: Downloads the latest version of KNIME and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.MendeleyReferenceManager
ParentRecipe: com.github.grahampugh.recipes.download.MendeleyReferenceManager
MinimumVersion: 1.0.0

Input:
  NAME: Mendeley Reference Manager

Process:
- Processor: AppPkgCreator
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/MendeleyReferenceManager-%version%.pkg'
