Description: Creates an unlicensed package from the downloaded Mathematica app.
Identifier: com.github.grahampugh.recipes.pkg.Mathematica
Input:
  LANGUAGE: EN
  LIST_NAME: Mathematica Node
  NAME: Mathematica
MinimumVersion: 1.0.0
ParentRecipe: NEEDS-OWN-DOWNLOAD-RECIPE
Process:
- Arguments:
    overwrite: false
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
  Processor: AppPkgCreator
