Description: Downloads the latest version of ThinLinc Client and creates a package.
Identifier: ch.ethz.id.pkg.ThinLincClient
Input:
  BUNDLE_ID: se.cendio.tlclient
  NAME: ThinLinc Client
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.download.ThinLincClient
Process:
- Processor: AppPkgCreator
