Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of ThinLinc Client.
Identifier: com.github.grahampugh.recipes.download.ThinLincClient
MinimumVersion: "2.3"

Input:
  NAME: ThinLinc Client
  DOWNLOAD_URL: "%SITE_URL%/thinlinc/download"
  SITE_URL: https://www.cendio.com
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '"(?P<match>/downloads/clients/tl.*-client-macos\.iso)"'
      result_output_var_name: url
      url: "%DOWNLOAD_URL%"

  - Processor: URLDownloader
    Arguments:
      filename: ThinLincClient.iso
      url: "%SITE_URL%%match%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/ThinLinc Client.app"
      requirement: identifier "se.cendio.tlclient" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PHUT6TWL4H
