<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of DataWarrior and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.pkg.DataWarrior</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>org.openmolecules.datawarrior</string>
		<key>DOWNLOAD_URL</key>
		<string>http://www.openmolecules.org/datawarrior/download.html</string>
		<key>NAME</key>
		<string>DataWarrior</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.download.DataWarrior</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(.*Download DataWarrior V(?P&lt;webversion&gt;\d\.\d+\.\d+).*)</string>
				<key>result_output_var_name</key>
				<string>webversion</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist</string>
				<key>output_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist</string>
				<key>plist_data</key>
				<dict>
					<key>CFBundleShortVersionString</key>
					<string>%webversion%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistEditor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%webversion%.pkg</string>
				<key>version</key>
				<string>%webversion%</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
