Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Installs the latest version of DataWarrior.
Identifier: com.github.grahampugh.install.DataWarrior
Input:
  NAME: DataWarrior
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.download.DataWarrior
Process:
- Arguments:
    dmg_path: '%pathname%'
    items_to_copy:
    - destination_path: /Applications
      source_item: DataWarrior.app
  Processor: InstallFromDMG
