<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of DataWarrior.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.download.DataWarrior</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>http://www.openmolecules.org/datawarrior/download.html</string>
		<key>NAME</key>
		<string>DataWarrior</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
                <key>re_pattern</key>
				<string>(?P&lt;match&gt;http.*?dmg\?dl=1)</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
                <key>result_output_var_name</key>
				<string>webversion</string>
                <key>re_pattern</key>
				<string>(.*Download DataWarrior V(?P&lt;webversion&gt;\d\.\d+\.\d+).*)</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
                <key>overwrite</key>
				<true/>
			</dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>PlistEditor</string>
            <key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist</string>
                <key>output_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app/Contents/Info.plist</string>
                <key>plist_data</key>
                <dict>
                     <key>CFBundleShortVersionString</key>
                     <string>%webversion%</string>
                 </dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
