<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of DataWarrior and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.pkg.DataWarrior</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>org.openmolecules.datawarrior</string>
		<key>NAME</key>
		<string>DataWarrior</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.download.DataWarrior</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>version</key>
				<string>%webversion%</string>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.app</string>
                <key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>overwrite</key>
				<false/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
