Identifier: com.github.grahampugh.recipes.jamfv.JamfVersioner
Input:
  CATEGORY: Administration
  EXCLUSION_GROUP_NAME: '%NAME% installed'
  EXCLUSION_GROUP_TEMPLATE: '%NAME%-SmartGroupTemplate-test-installed.xml'
  EXTENSION_ATTRIBUTE: '%NAME%-ExtensionAttribute.xml'
  GROUP_NAME: '%NAME% test users'
  GROUP_TEMPLATE: SmartGroupTemplate-test-users.xml
  NAME: Jamf Versioner
  POLICY_CATEGORY: Untested
  POLICY_TEMPLATE: '%NAME%-PolicyTemplate.xml'
  PROD_NAME: '%NAME%'
  STOP_IF_NO_JSS_UPLOAD: True
MinimumVersion: 0.4.0
ParentRecipe: com.github.grahampugh.recipes.pkg.JamfVersioner
Process:
- Arguments:
    category: '%CATEGORY%'
    exclusion_groups:
    - name: '%EXCLUSION_GROUP_NAME%'
      smart: true
      template_path: '%EXCLUSION_GROUP_TEMPLATE%'
    extension_attributes:
    - ext_attribute_path: '%EXTENSION_ATTRIBUTE%'
    groups:
    - name: '%GROUP_NAME%'
      smart: true
      template_path: '%GROUP_TEMPLATE%'
    pkg_path: '%RECIPE_CACHE_DIR%/JamfVersioner-%version%.pkg'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: '%POLICY_TEMPLATE%'
    prod_name: '%PROD_NAME%'
  Processor: JSSImporter
