Description: |
    Note: Jamf Versioner does not include a code signature. If your organization requires code signature, it is recommended to internally sign the application.

    The GitHubReleasesInfoProvider processor used by this recipe also respects an input variable: ''sort_by_highest_tag_names'', which, if set, will ignore the post dates of the releases and instead sort descending by tag names according to LooseVersion semantics.
Identifier: com.github.grahampugh.recipes.download.JamfVersioner
Input:
  INCLUDE_PRERELEASES: 'True'
  NAME: Jamf Versioner
  STOPPROCESSINGIF_PREDICATE: 'download_changed == False'
MinimumVersion: 0.5.0
Process:
- Arguments:
    asset_regex: ^jamf-versioner.*?pkg$
    github_repo: grahampugh/jamf-versioner
    include_prereleases: '%INCLUDE_PRERELEASES%'
  Processor: GitHubReleasesInfoProvider
- Processor: URLDownloader
- Processor: EndOfCheckPhase
- Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'
  Processor: StopProcessingIf
