Identifier: com.github.grahampugh.recipes.pkg.JamfVersioner
Input:
  NAME: Jamf Versioner
ParentRecipe: com.github.grahampugh.recipes.download.JamfVersioner
Process:
- Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/JamfVersioner-%version%.pkg'
    overwrite: true
    source_path: '%pathname%'
  Processor: Copier
