Description: Creates an installable package for ChemComp MOE.
Identifier: com.github.grahampugh.recipes.pkg.MOE
Input:
  EXCEPTION: ''
  LOCAL_REPO: /Volumes/Packaging/mac-resources
  NAME: ChemComp_MOE
  VENDOR: Chemical_Computing_Group
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.recipes.download.MOE
Process:
- Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/Scripts'
  Processor: PkgRootCreator
- Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
  Processor: PkgRootCreator
- Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/Scripts/moe%version%_installer.app'
    source_path: '%RECIPE_CACHE_DIR%/downloads/%latest_file%.dmg/moe%version%_installer.app'
  Processor: Copier
- Arguments:
    file_content: |
        #!/bin/bash
        ## script to install MOE

        DIR=$(dirname "$0")

        # function to run the MOE Installer Package with command line tools

        $DIR/moe%version%_installer.app/Contents/MacOS/moe%version%_installer -r installer.properties

        if [[ $? == 0 || $? == 1 ]]; then
            exit 0
        else
            exit 1
        fi
    file_mode: '0755'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/postinstall'
  Processor: FileCreator
- Arguments:
    file_content: 'INSTALLER_UI=SILENT

      USER_INSTALL_DIR=/Applications

      '
    file_mode: '0644'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/installer.properties'
  Processor: FileCreator
- Arguments:
    info_path: '%RECIPE_CACHE_DIR%/Scripts/moe%version%_installer.app/Contents/Info.plist'
  Processor: moeVersioner
- Arguments:
    force_pkg_build: true
    pkg_request:
      chown: []
      id: com.chemcomp.pkg.moe
      pkgname: '%NAME%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      scripts: Scripts
      version: '%version%'
  Processor: PkgCreator
