Description: |
  This recipe is designed to repackage the Adobe Creative Cloud Desktop Application installer package that is generated in the Adobe Admin Console. This is necessary to make the package installable via Jamf Pro.

  This recipe has no parent '.download' recipe, since that is a manual process. You have to provide the path to a downloaded zip file from the Adobe admin console. You also need to provide a version number, as this is not extractable from the package. Therefore, to run this recipe, you need to run as follows:

  autopkg run "AdobeCCDAFromConsoleForJamfPro.jss-upload" --key pathname=/path/to/Adobe_CCDA_downloaded.zip --key version=5.0.0.354
Identifier: com.github.grahampugh.recipes.jss-upload.AdobeCCDAFromConsoleForJamfPro
ParentRecipe: com.github.grahampugh.recipes.pkg.AdobeCCDAFromConsoleForJamfPro
MinimumVersion: "2.3"

Input:
  NAME: Adobe Creative Cloud
  CATEGORY: Productivity

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: JSSImporter, which this recipe requires, is no longer maintained. Consider switching to an equivalent JamfUploader recipe (https://github.com/grahampugh/jamf-upload/wiki/JamfUploader-AutoPkg-Processors). This JSS recipe will be removed in the future.

  - Processor: JSSImporter
    Arguments:
      category: "%CATEGORY%"
      prod_name: "%NAME%"
