Description: Downloads the latest version of CotEditor and creates a package. Then, uploads to the Jamf Pro Server.
Identifier: com.github.grahampugh.jss-upload.CotEditor
ParentRecipe: com.github.grahampugh.pkg.CotEditor
MinimumVersion: "2.3"

Input:
  NAME: CotEditor
  CATEGORY: Apps

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: JSSImporter, which this recipe requires, is no longer maintained. Consider switching to an equivalent JamfUploader recipe (https://github.com/grahampugh/jamf-upload/wiki/JamfUploader-AutoPkg-Processors). This JSS recipe will be removed in the future.

  - Processor: JSSImporter
    Arguments:
      category: "%CATEGORY%"
      prod_name: "%NAME%"
