Description: Downloads the latest version of FileZilla and creates a package. Then, uploads to the Jamf Pro Server.
Identifier: com.github.grahampugh.recipes.jss-upload.FileZilla
MinimumVersion: "2.3"
ParentRecipe: com.github.grahampugh.recipes.pkg.FileZilla

Input:
  CATEGORY: Connect and Remote
  NAME: FileZilla

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: JSSImporter, which this recipe requires, is no longer maintained. Consider switching to an equivalent JamfUploader recipe (https://github.com/grahampugh/jamf-upload/wiki/JamfUploader-AutoPkg-Processors). This JSS recipe will be removed in the future.
      
  - Arguments:
      category: "%CATEGORY%"
      prod_name: "%NAME%"
    Processor: JSSImporter
