Description: Downloads the latest MestReNova release and copies it to the recipe cache root. Then, uploads to the Jamf Pro Server.
Identifier: com.github.grahampugh.recipes.jss-upload.MestReNova
ParentRecipe: com.github.grahampugh.recipes.pkg.MestReNova
MinimumVersion: "2.3"

Input:
  NAME: MestReNova
  CATEGORY: Science & Math

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: JSSImporter, which this recipe requires, is no longer maintained. Consider switching to an equivalent JamfUploader recipe (https://github.com/grahampugh/jamf-upload/wiki/JamfUploader-AutoPkg-Processors). This JSS recipe will be removed in the future.

  - Processor: JSSImporter
    Arguments:
      category: "%CATEGORY%"
      prod_name: "%NAME%"
