Description: Downloads the latest version of FileZilla and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.FileZilla
Input:
  BUNDLE_ID: org.filezilla-project.filezilla.pkg
  NAME: FileZilla
ParentRecipe: com.github.grahampugh.recipes.download.FileZilla
Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%/*.app'
    force_pkg_build: true
