Description: Downloads the current stable version of FileZilla.
Identifier: com.github.grahampugh.recipes.download.FileZilla
MinimumVersion: "2.3"

Input:
  NAME: FileZilla
  SEARCH_URL: https://filezilla-project.org/download.php?show_all=1

Process:
  - Arguments:
      re_pattern: <p>The latest stable version of FileZilla Client is (?P<dl_version>.*)<\/p>
      url: "%SEARCH_URL%"
    Processor: URLTextSearcher

  - Arguments:
      re_pattern: '"(?P<url>https://.*/client/FileZilla_.*_macosx-x86\S+)"'
      url: "%SEARCH_URL%"
    Processor: URLTextSearcher

  - Arguments:
      CHECK_FILESIZE_ONLY: true
      filename: "%NAME%-%dl_version%.tar.bz2"
    Processor: URLDownloader

  - Processor: EndOfCheckPhase

  - Arguments:
      archive_format: tar_bzip2
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: True
    Comment: Unzipping for code signature verification. Path must be deleted afterwards to prevent unzipping over existing version.
    Processor: Unarchiver

  - Arguments:
      input_path: "%RECIPE_CACHE_DIR%/unzip/FileZilla.app"
      requirement: identifier "org.filezilla-project.filezilla" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5VPGKXL75N"
    Processor: CodeSignatureVerifier
