Description: This recipe is now deprecated as it does not work for FileMaker Pro version 2023 or newer. I advise you to use apizz-recipes/FileMakerProClaris.download instead.
Identifier: com.github.grahampugh.recipes.download.FileMakerPro

Input:
  NAME: FileMaker Pro
  MAJOR_VERSION: "19"

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: "This recipe is now deprecated as it does not work for FileMaker Pro version 2023 or newer. I advise you to use apizz-recipes/FileMakerProClaris.download instead."

  - Processor: FileMakerProURLProcessor
    Arguments:
      major_version: "%MAJOR_VERSION%"

  - Processor: URLDownloader
    Arguments:
      url: https://downloads.claris.com/esd/fmp_%version%.dmg

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/FileMaker Pro.app"
      requirement: identifier "com.filemaker.client.pro12" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J6K4T76U7W
