<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads latest FileMaker Pro updater disk image and extracts the package from within. This will only work for versions 19 and above.</string>
		<key>Identifier</key>
		<string>com.github.grahampugh.recipes.download.FileMakerPro</string>
		<key>Input</key>
		<dict>
			<key>MAJOR_VERSION</key>
			<string>19</string>
			<key>NAME</key>
			<string>FileMaker Pro</string>
			<key>STOPPROCESSINGIF_PREDICATE</key>
			<string>download_changed == FALSE</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>major_version</key>
					<string>%MAJOR_VERSION%</string>
				</dict>
				<key>Processor</key>
				<string>FileMakerProURLProcessor</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://downloads.claris.com/esd/fmp_%version%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>%STOPPROCESSINGIF_PREDICATE%</string>
				</dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
			</dict>
		</array>
	</dict>
</plist>
