Description: "Creates a package for FileMaker Pro Advanced.\nThere is no download recipe since FileMaker Pro Advanced is not publicly available.\nRequires running as: autopkg run --pkg /path/to/downloaded-fmpa.dmg \"FilemakerProAdvanced.pkg\"\nYou must also override the keys LICENSE_KEY and LICENSED_ORG.\n"
Identifier: com.github.grahampugh.recipes.pkg.FilemakerProAdvanced
ParentRecipe: ch.ethz.id.check.FilemakerProAdvanced

Input:
  NAME: FileMaker Pro Advanced
  LICENSED_ORG: Example Company
  LICENSE_FILE_SOURCE: /path/to/license_file (LicenseCert.fmcert)
  MAJOR_VERSION: '18'
  STOP_PREDICATE: file_exists == True

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/Scripts'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/temp_for_version'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/temp_unpack'

- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/Scripts/FileMakerProAdvancedInstaller.pkg'
    source_pkg: '%pathname%/*.pkg'

- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/temp_for_version'
    flat_pkg_path: '%pkg_path%'
    purge_destination: true

- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/temp_for_version/fmpa*Application.pkg'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/temp_unpack'
    pkg_payload_path: '%found_filename%/Payload'
    purge_destination: true

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/temp_unpack/FileMaker Pro %MAJOR_VERSION% Advanced.app/Contents/Info.plist'

- Processor: FileCreator
  Arguments:
    file_content: "AI_USERNAME=ETH Administrator\nAI_ORGANIZATION=%LICENSED_ORG%\nAI_LICENSEKEY=\nAI_NONEWDATABASES=0\nAI_REGISTRATION=0\nAI_SKIPDIALOG=1\nAI_DISABLEUPDATENOTIFY=1\nAI_DISABLEVERSIONNOTIFY=1\nAI_DISABLEPLUGINS=0\nAI_DISABLEXDBC=0\nAI_DISABLEIWP=0\nAI_LICENSE_ACCEPTED=1\n"
    file_mode: '0644'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/Assisted Install.txt'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/Scripts/LicenseCert.fmcert'
    source_path: '%LICENSE_FILE_SOURCE%'

- Processor: FileCreator
  Arguments:
    file_content: "#!/bin/sh\n\ninstaller -tgt / -pkg FileMakerProAdvancedInstaller.pkg\n"
    file_mode: '0755'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/postinstall'

- Processor: PkgCreator
  Arguments:
    force_pkg_build: true
    pkg_request:
      chown: []
      id: com.filemaker.FileMakerPro%MAJOR_VERSION%AdvancedInstaller
      pkgname: '%LIST_NAME%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      scripts: Scripts
      version: '%version%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/temp_for_version'
    - '%RECIPE_CACHE_DIR%/temp_unpack'
    - '%RECIPE_CACHE_DIR%/Scripts'
    - '%RECIPE_CACHE_DIR%/pkgroot'
