Description: Downloads latest FileMaker Pro Advanced updater disk image and extracts the package from within.
Identifier: com.github.grahampugh.recipes.download.filemakerproadvancedupdater

Input:
  NAME: FileMaker Pro Advanced
  MAJOR_VERSION: '16'
  STOPPROCESSINGIF_PREDICATE: download_changed == FALSE

Process:
- Arguments:
    major_version: '%MAJOR_VERSION%'
  Processor: FilemakerProAdvancedUpdateURLProcessor

- Processor: URLDownloader

- Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'
  Processor: StopProcessingIf
