Description: Downloads the latest version of KNIME and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.KNIME
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.download.KNIME

Input:
  BUNDLE_ID: org.knime.product
  NAME: KNIME

Process:
  - Processor: AppPkgCreator
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
