# Knime requires URLDownloader and Versioner
---
Description: Downloads the latest version of KNIME.
Identifier: com.github.grahampugh.download.KNIME
Input:
  DOWNLOAD_URL: https://download.knime.org/analytics-platform/macosx/knime-latest-app.macosx.cocoa.x86_64.dmg
  NAME: KNIME
MinimumVersion: 1.0.0
Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: '%DOWNLOAD_URL%'
- Processor: EndOfCheckPhase
- Processor: StopProcessingIf
  Arguments:
    predicate: 'download_changed == False'
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/KNIME*.app'
    requirement: identifier "org.knime.product" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = V7WZJX2HS9
- Processor: Copier
  Arguments:
    source_path: '%pathname%/KNIME*.app'
    destination_path: '%RECIPE_CACHE_DIR%/downloads/KNIME.app'
- Processor: Versioner
  Arguments:
    input_plist_path: '%destination_path%/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
- Processor: PathDeleter
  Arguments:
    path_list:
      - '%RECIPE_CACHE_DIR%/downloads/KNIME.app'
