Description: Uploads a script to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.grahampugh.recipes.jamf.ChangeAccountPasswordWithDialog-script
MinimumVersion: "2.3"

Input:
  NAME: Change account password with on-screen dialogue
  GROUP_NAME: "%NAME%-self-service"
  GROUP_TEMPLATE: SmartGroup-script-self-service.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Admin-Tools
  POLICY_TEMPLATE: Policy-script-self-service.xml
  POLICY_NAME: "%NAME%"
  SCRIPT_NAME: Change-Account-Password-With-Dialog.sh
  SCRIPT_PRIORITY: After
  SCRIPT_PARAMETER4: short user name (account name)
  SCRIPT_PARAMETER5: minimum characters for password
  SCRIPT_PARAMETER6: password complexity - none or complex
  SELF_SERVICE_DISPLAY_NAME: Change account password with on-screen dialogue
  SELF_SERVICE_DESCRIPTION: |
    Use this tool to change the password of another account on this computer. 

    It is not recommended to use this tool to change the password of your current account. You can do that using System Preferences.
  SELF_SERVICE_ICON: System Preferences.png
  INSTALL_BUTTON_TEXT: Start
  REINSTALL_BUTTON_TEXT: Start
  replace_policy: "True"
  replace_script: "True"
  replace_group: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfScriptUploader
    Arguments:
      script_category: "%POLICY_CATEGORY%"
      script_path: "%SCRIPT_NAME%"
      script_priority: "%SCRIPT_PRIORITY%"
      script_parameter4: "%SCRIPT_PARAMETER4%"
      script_parameter5: "%SCRIPT_PARAMETER5%"
      script_parameter6: "%SCRIPT_PARAMETER6%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELF_SERVICE_ICON%"
