Description: "Note: munkitools does not include a code signature. If your organization requires code signature, it is recommended to internally sign the application.\n\nDownloads version 3 of the Munki tools via the official releases listing on GitHub. You can set INCLUDE_PRERELEASES to any value to have this recipe pull prerelease versions.\n\nThis recipe also extracts the core components, and repackages them for use in Jamf Pro.\nOther parts of munkitools are not repackaged.\n\nThis recipe cannot be overridden to pull a download from an alternate location such as munkibuilds.org - it will only download the official releases. For this, use the munkitools2-autobuild.munki recipe with a manually-provided DOWNLOAD_URL variable.\n\nThe GitHubReleasesInfoProvider processor used by this recipe also respects an input variable: ''sort_by_highest_tag_names'', which, if set, will ignore the post dates of the releases and instead sort descending by tag names according to LooseVersion semantics.\n"
Identifier: com.github.grahampugh.recipes.pkg.MunkiToolsCore
MinimumVersion: 0.5.0

Input:
  NAME: MunkiToolsCore
  INCLUDE_PRERELEASES: ''
  STOPPROCESSINGIF_PREDICATE: download_changed == False
  MAJOR_VERSION: '5'

Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: ^munkitools-%MAJOR_VERSION%.*?pkg$
    github_repo: munki/munki
    include_prereleases: '%INCLUDE_PRERELEASES%'

- Processor: URLDownloader

- Processor: StopProcessingIf
  Comment: Checks if the file already exists in the cache
  Arguments:
    predicate: '%STOPPROCESSINGIF_PREDICATE%'

- Processor: EndOfCheckPhase

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Profiles: '0755'
      Profiles/vpn: '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/Scripts'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/Scripts/munkitools-%version%.pkg'
    source_pkg: '%pathname%'

- Processor: com.github.grahampugh.recipes.commonprocessors/ChoicesXMLGenerator
  Arguments:
    choices_pkg_path: '%pkg_path%'
    choices_xml_dest: '%RECIPE_CACHE_DIR%/Scripts/choices.xml'
    desired_choices:
    - core
    - python

- Processor: FileCreator
  Arguments:
    file_content: "#!/bin/bash\n## script to install Munki Core Tools and MunkiPython only\n\nDIR=$(dirname \"$0\")\n\n/usr/sbin/installer -applyChoiceChangesXML \"$DIR/choices.xml\" -pkg \"$DIR/munkitools-%version%.pkg\" -target /\n\nif (test $? = 0) then\n    echo \"Munki Core Tools installed.\"\nelse\n    echo \"ERROR: Munki Core Tools installation failed.\"\n    exit 1\nfi\n"
    file_mode: '0755'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/postinstall'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown: []
      id: com.github.grahampugh.recipes.pkg.MunkiToolsCore
      pkgname: munkitools-core-plus-python-%version%
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      scripts: Scripts
      version: '%version%'
