<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version pkg of munkitools, then copies the package to the DeployStudio packages repository.
Input keys:
- DS_PKGS_PATH is the path for the Packages folder in the DeployStudio repository (trailing slash not required/desired).
  The path does not need to be on the same volume as the cache, as the pkg is being duplicated.
</string>
    <key>Identifier</key>
    <string>com.github.grahampugh.ds.munkitools2</string>
    <key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
<!-- Change this path to suit the path to your repo, for instance if it's on a mounted volume. You could do this with an autopkg override. -->
        <string>/Users/Shared/DeployStudio/Packages</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.grahampugh.downloads.munkitools2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
<!-- Depending on the processor in the parent recipe, either download_changed (used by URLDownloader) 
or new_package_request (used by PkgCreator) will be used to the left of the ==. -->
                <string>download_changed == FALSE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/munkitools-2.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
   </array>
</dict>
</plist>