Description: Downloads the current version of Howard Oakley's silnite, and creates a pkg.
Identifier: com.github.grahampugh.recipes.pkg.SilentKnight
ParentRecipe: com.github.grahampugh.recipes.download.SilentKnight
MinimumVersion: "2.3"

Input: {}

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.app"
      force_pkg_build: false
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
