Description: Installs the latest version of SilentKnight.
Identifier: com.github.grahampugh.recipes.install.SilentKnight
ParentRecipe: com.github.grahampugh.recipes.download.SilentKnight
MinimumVersion: "2.3"

Input:
  NAME: SilentKnight

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/SilentKnight"
      purge_destination: True

  - Processor: com.github.grahampugh.recipes.commonprocessors/InstallApp
    Arguments:
      destination_path: "~/Applications/SilentKnight.app"
      app_path: "%RECIPE_CACHE_DIR%/SilentKnight"
