Description: "Creates a package from a pre-downloaded JMP installer which has already been installed on a client, and the SIP file converted to a JMP.per file as per the instructions in the JMP Deployment Guide.\nYou need to manually supply the JMP version, since attempts to extract this from the installer have so far failed.\n"
Identifier: com.github.grahampugh.recipes.pkg.JMP
MinimumVersion: 1.0.0

Input:
  NAME: JMP
  JMP_VERSION: '14.1'

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/Scripts'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/Scripts/JMP_%MAJOR_VERSION%.dmg'
    overwrite: true
    source_path: '%pathname%'

- Processor: FileCreator
  Arguments:
    file_content: "#!/bin/bash\nDIR=$(dirname \"$0\")\nMAJOR=$(echo \"%JMP_VERSION%\" | cut -d\".\" -f1)\nMINOR=$(echo \"%JMP_VERSION%\" | cut -d\".\" -f2)\n\n# attach main image\necho \"Mounting JMP image\"\nhdiutil attach ${DIR}/JMP_${MAJOR}.dmg -nobrowse\n\n# attach installer image, located inside main image\necho \"Mounting JMP installer image\"\nhdiutil attach /Volumes/JMP_${MAJOR}_${MINOR}/JMP/JMP/${MAJOR}_${MINOR}/Macintosh/JMP-Install.dmg -nobrowse\n\n# install JMP with Company License\ninstaller -target / -pkg \"/Volumes/JMP-${MAJOR}-Installer/JMP ${MAJOR}.pkg\"\n\n# eject mounted JMP volumes\nfor path in /Volumes/JMP*; do\n    [ -d \"${path}\" ] || continue # if not a directory, skip\n    dirname=\"$(basename \"${path}\")\"\n    hdiutil eject ${path}\ndone\n\n# relocate license\nif [[ -f \"$HOME/Library/Application Support/JMP/${MAJOR}/JMP.per\" ]]; then\n    /bin/mv \"$HOME/Library/Application Support/JMP/${MAJOR}/JMP.per\" \\\n    \"/Library/Application Support/JMP/${MAJOR}/JMP.per\"\nelif [[ -f \"/var/root/Library/Application Support/JMP/${MAJOR}/JMP.per\" ]]; then\n    /bin/mkdir -p \"/Library/Application Support/JMP/${MAJOR}\"\n    /bin/mv \"/var/root/Library/Application Support/JMP/${MAJOR}/JMP.per\" \\\n    \"/Library/Application Support/JMP/${MAJOR}/JMP.per\"\n    # change permissions\n    /bin/chmod 644 \"/Library/Application Support/JMP/${MAJOR}/JMP.per\"\nelse\n    echo \"ERROR: JMP.per not found\"\n    exit 1\nfi\nif [[ -f \"/Library/Application Support/JMP/${MAJOR}/JMP.per\" ]]; then\n    # define license location\n    /usr/bin/defaults write \"/Library/Preferences/com.sas.jmp.plist\" Setinit_${MAJOR}_Path \"/Library/Application Support/JMP/${MAJOR}/JMP.per\"\nelse\n    echo \"ERROR: JMP.per not found in Library folder\"\n    exit 1\nfi\n"
    file_mode: '0755'
    file_path: '%RECIPE_CACHE_DIR%/Scripts/postinstall'

- Processor: PkgCreator
  Arguments:
    force_pkg_build: true
    pkg_request:
      chown: []
      id: com.jmp.pkg.JMP
      pkgname: '%NAME%-%MAJOR_VERSION%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      scripts: Scripts
      version: '%version%'
