Description: |
   Creates a package of the Recon, Remote and Composer apps from the downloaded installer.
   A download recipe is not provided here, since this is behind a login.
Identifier: com.github.grahampugh.recipes.pkg.JamfProSuite
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.recipes.download.JamfProSuite
Input:
  NAME: Jamf Pro
  EXCEPTION: ''
  LOCAL_REPO: /Volumes/Packaging/mac-resources
  LIST_NAME: Jamf_Pro_Suite
  VENDOR: JAMF_Software
Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0755'
      'Applications/Jamf Pro': '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Jamf Pro/Recon.app'
    source_path: '%pathname%/Jamf Pro/Recon.app'
- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Jamf Pro/Jamf Remote.app'
    source_path: '%pathname%/Jamf Pro/Jamf Remote.app'
- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Jamf Pro/Composer.app'
    source_path: '%pathname%/Jamf Pro/Composer.app'
- Processor: Versioner
  Arguments:
    input_plist_path: '%pkgroot%/Applications/Jamf Pro/Recon.app/Contents/Info.plist'
- Processor: PkgCreator
  Arguments:
    force_pkg_build: true
    pkg_request:
      id: com.jamf.pkg.JamfProApps
      pkgname: '%NAME%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      version: '%version%'
      chown:
      - path: '/Applications/Jamf Pro'
        user: root
        group: admin
        mode: '0755'
      - path: '/Applications/Jamf Pro/Jamf Remote.app'
        user: root
        group: admin
        mode: '0755'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%pkgroot%'
