<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>This example recipe can simply be an override rather than a full recipe.</string>
	<key>Description</key>
	<string>Creates a script and a Self-Service uninstaller policy for Carbon Copy Cloner.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.jss-uninstall.CarbonCopyCloner</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Carbon Copy Cloner</string>
		<key>PKG_ID</key>
		<string>com.bombich.ccc</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.jss-uninstall.UninstallApplication</string>
	<key>Process</key>
	<dict>
	</dict>
</dict>
</plist>
