<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>For standard applications, only Identifier and PKG_ID need to be overridden. If more than one package was installed, use PKG_ID_2 up to PKG_ID_5.
</string>
	<key>Description</key>
	<string>Uploads a pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.jss-uninstall.UninstallApplication</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Uninstallers</string>
		<key>INSTALLED_GROUP_NAME</key>
		<string>%POLICY_NAME% installed</string>
		<key>INSTALLED_GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate-installed.xml</string>
		<key>JSS_INVENTORY_NAME</key>
		<string>%NAME%.app</string>
		<key>NAME</key>
		<string>++ADD APPLICATION NAME HERE++</string>
		<key>PKG_ID</key>
		<string>++ADD PACKAGE ID e.g. com.apple.something.pkg++</string>
		<key>PROD_NAME</key>
		<string>%NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>STOP_IF_NO_JSS_UPLOAD</key>
		<false/>
		<key>UNINSTALL_POLICY_CATEGORY</key>
		<string>Uninstallers</string>
		<key>UNINSTALL_POLICY_TEMPLATE</key>
		<string>PolicyTemplate-uninstall.xml</string>
		<key>UNINSTALL_SELF_SERVICE_DESCRIPTION</key>
		<string>Uninstalls %POLICY_NAME%</string>
		<key>UNINSTALL_SELF_SERVICE_DISPLAY_NAME</key>
		<string>Uninstall %POLICY_NAME%</string>
		<key>UNINSTALL_SELF_SERVICE_INSTALL_BUTTON</key>
		<string>Uninstall</string>
		<key>UNINSTALL_SELF_SERVICE_REINSTALL_BUTTON</key>
		<string>Uninstall</string>
		<key>UNINSTALL_TRIGGERONLY_POLICY_CATEGORY</key>
		<string>Triggered Uninstallers</string>
		<key>UNINSTALL_TRIGGER_NAME</key>
		<string>%POLICY_NAME%-uninstall</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.jss-script.UninstallApplication</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%UNINSTALL_POLICY_CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%INSTALLED_GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%INSTALLED_GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>jss_inventory_name</key>
				<string>%JSS_INVENTORY_NAME%</string>
				<key>pkg_path</key>
				<string></string>
				<key>policy_category</key>
				<string>%UNINSTALL_POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%UNINSTALL_POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
				<key>scripts</key>
				<array>
					<dict>
						<key>name</key>
						<string>%NAME%-uninstall.sh</string>
						<key>template_path</key>
						<string>%RECIPE_DIR%/%NAME%-ScriptTemplate-uninstall.xml</string>
					</dict>
				</array>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
