<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of erase-install and creates a package containing the script. The expectation is that this would be used with a postinstall script containing the parameters required to use this script for upgrading or reinstalling macOS on clients.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.pkg.erase-install</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>erase-install</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.download.erase-install</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Library</key>
					<string>0755</string>
					<key>Library/Management</key>
					<string>0755</string>
					<key>Library/Management/erase-install</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/Management/erase-install/erase-install.sh</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/erase-install-%version%/erase-install.sh</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>group</key>
				<string>wheel</string>
				<key>mode</key>
				<string>755</string>
				<key>owner</key>
				<string>root</string>
				<key>resource_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Library/Management/erase-install/erase-install.sh</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/ChangeModeOwner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>force_pkg_build</key>
				<true/>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Library/Management</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>/Library/Management/erase-install</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.github.grahampugh.erase-install.pkg</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
