Description: Downloads the latest version of erase-install and creates a package containing the script. The expectation is that this would be used with a postinstall script containing the parameters required to use this script for upgrading or reinstalling macOS on clients.
Identifier: com.github.grahampugh.recipes.pkg.erase-install
ParentRecipe: com.github.grahampugh.recipes.download.erase-install
MinimumVersion: "2.3"

Input:
  NAME: erase-install

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/erase-install-%version%.pkg"
      source_pkg: "%pathname%"
