<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Firefox and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group. Values for FIREFOX_BUILD correspond to directories here: http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
Some useful values are: 'latest', 'latest-10.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
LOCALE corresponds to directories at http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$FIREFOX_BUILD/mac/
Examples include 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'
No idea if all Firefox builds are available in all the same localizations, so you may need to verify that any particular combination is offered.
</string>
	<key>Identifier</key>
	<string>com.github.autopkg.grahampugh-recipes.jamf.Firefox-patch</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>NAME</key>
		<string>Firefox</string>
		<key>PATCH_ENABLED</key>
		<string>true</string>
		<key>PATCH_NAME</key>
		<string>%NAME%</string>
		<key>PATCH_SOFTWARE_TITLE</key>
		<string>%NAME%</string>
		<key>PATCH_TEMPLATE</key>
		<string>PatchTemplate-selfservice.xml</string>
		<key>POLICY_NAME</key>
		<string>Install Latest %NAME%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.grahampugh-recipes.jamf.Firefox</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>patch_icon_policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>patch_name</key>
				<string>%PATCH_NAME%</string>
				<key>patch_softwaretitle</key>
				<string>%PATCH_SOFTWARE_TITLE%</string>
				<key>patch_template</key>
				<string>%PATCH_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPatchUploader</string>
		</dict>
	</array>
</dict>
</plist>
