<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of KNIME and creates a package.</string>
	<key>Identifier</key>
	<string>ch.ethz.id.pkg.KNIME</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>org.knime.product</string>
		<key>NAME</key>
		<string>KNIME</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>ch.ethz.id.download.KNIME</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
