Description: Downloads the latest version of KNIME and creates a package.
Identifier: ch.ethz.id.pkg.KNIME
Input:
  BUNDLE_ID: org.knime.product
  NAME: KNIME
MinimumVersion: 1.0.0
ParentRecipe: com.github.grahampugh.download.KNIME
Process:
- Processor: AppPkgCreator
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
