# Knime requires URLDownloader and Versioner
---
Description: Downloads the latest version of KNIME.
Identifier: com.grahampugh.KNIME
Input:
  DOWNLOAD_URL: https://download.knime.org/analytics-platform/macosx/knime-latest-app.macosx.cocoa.x86_64.dmg
  NAME: KNIME
MinimumVersion: 1.0.0
Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: '%DOWNLOAD_URL%'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/KNIME*.app'
    requirement: identifier "org.knime.product" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = V7WZJX2HS9
- Processor: FileFinder
  Arguments:
    pattern: '%pathname%/KNIME*.app'
- Processor: Versioner
  Arguments:
    input_plist_path: '%found_filename%/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
