Description: Finds version of downloaded Maple package and copies the package to a name with version included.
Identifier: com.github.grahampugh.recipes.pkg.Maple
ParentRecipe: com.github.grahampugh.recipes.download.Maple
Input:
  NAME: Maple
  LICENSE: Floating
MinimumVersion: 1.0.0
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%/%latest_file%.pkg'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/unpack/Scripts/*.dmg'
- Processor: Copier
  Arguments:
    source_path: '%found_filename%/*.app'
    destination_path: '%RECIPE_CACHE_DIR%/unpack/temp.app'
- Processor: Versioner
  Arguments:
    input_plist_path: '%destination_path%/Contents/Info.plist'
- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%/%latest_file%.pkg'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%_%LICENSE%_%version%.pkg'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
