Description: Downloads the current release version of Amazon Corretto 8 LTS, and builds a package. This is based from the tar version rather than the signed pkg version, so that the true version number can be obtained.
Identifier: com.github.grahampugh.recipes.pkg.AmazonCorrettoJava11
Input:
  NAME: Amazon Corretto 11
  SEARCH_URL: https://docs.aws.amazon.com/corretto/latest/corretto-11-ug/downloads-list.html
  SEARCH_PATTERN: '(?P<url>https://.*?amazon-corretto-11.*?-macosx-x64\.tar\.gz)'
MinimumVersion: 1.0.0
ParentRecipe: com.github.rtrouton.download.OpenJDK11
Process:
- Arguments:
    pkgdirs:
      Library: '0755'
      Library/Java: '0755'
      Library/Java/JavaVirtualMachines: '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
  Processor: PkgRootCreator
- Arguments:
    archive_path: '%pathname%'
    destination_path: '%pkgroot%/Library/Java/JavaVirtualMachines'
    purge_destination: true
  Processor: Unarchiver
- Arguments:
    pattern: '%pkgroot%/Library/Java/JavaVirtualMachines/amazon-corretto-11.jdk/Contents/Info.plist'
  Processor: FileFinder
- Arguments:
    input_plist_path: '%found_filename%'
    plist_version_key: CFBundleVersion
  Processor: Versioner
- Arguments:
    pkg_request:
      chown:
      - group: wheel
        path: Library
        user: root
      - group: wheel
        path: Library/Java
        user: root
      - group: wheel
        path: Library/Java/JavaVirtualMachines
        user: root
      id: com.amazon.corretto-11.jdk
      options: purge_ds_store
      pkgname: 'AmazonCorettoJDK11-%version%'
      scripts: Scripts
      version: '%version%'
  Processor: PkgCreator
- Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/pkgroot'
  Processor: PathDeleter
