Description: Downloads the latest TeXLive Utility release and renames the pkg to include the version number.
Identifier: com.github.grahampugh.recipes.pkg.TeXLiveUtility
MinimumVersion: 0.2.9
ParentRecipe: com.github.grahampugh.recipes.download.TeXLiveUtility
Input:
  NAME: TeXLive Utility
Process:
- Processor: AppPkgCreator
  Arguments:
    force_pkg_build: true
    
