Description: Downloads the latest version of FinderServerFavourites and creates a package containing the script. The expectation is that this would be used with a postinstall script containing the parameters required to use this script for upgrading or reinstalling macOS on clients.
Identifier: com.github.grahampugh.recipes.pkg.FinderServerFavourites
ParentRecipe: com.github.grahampugh.recipes.download.FinderServerFavourites
MinimumVersion: "2.3"

Input: {}

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/FinderServerFavourites-%version%.pkg"
      source_pkg: "%pathname%"
