Description: Downloads the current release version of AdoptOpenJDK 8 and builds a package. This is based from the tar version rather than the signed pkg version, so that the true version number can be obtained. Then, uploads to the Jamf Pro Server.
Identifier: com.github.grahampugh.recipes.jss.AdoptOpenJDK8
ParentRecipe: com.github.grahampugh.recipes.pkg.AdoptOpenJDK8
MinimumVersion: "2.3"

Input:
  NAME: AdoptOpenJDK 8
  CATEGORY: Computer Science
  EXTENSION_ATTRIBUTE: "%NAME%-ExtensionAttribute.xml"
  EXTENSION_ATTRIBUTE_NAME: AdoptOpenJDK8Versiomn
  GROUP_NAME: "%NAME%-update-smart"
  GROUP_TEMPLATE: SmartGroup-update-smart-EA-regex.xml
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: Policy-install-latest.xml
  SCRIPT: "%NAME%-preinstall.sh"
  SCRIPT_TEMPLATE: "%NAME%-preinstall-ScriptTemplate.xml"
  SELF_SERVICE_DESCRIPTION: The AdoptOpenJDK Java Development Toolkit, version 8.
  SELF_SERVICE_ICON: AdoptOpenJDK.png
  TESTING_GROUP_NAME: Testing

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: JSS recipes are being removed from grahampugh-recipes. For examples of functional jamf recipes, see grahampugh/jss-recipes

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: JSSImporter
    Arguments:
      category: "%CATEGORY%"
      extension_attributes:
        - ext_attribute_path: "%EXTENSION_ATTRIBUTE%"
      groups:
        - name: "%GROUP_NAME%"
          smart: true
          template_path: "%GROUP_TEMPLATE%"
      policy_category: "%POLICY_CATEGORY%"
      policy_template: "%POLICY_TEMPLATE%"
      prod_name: "%NAME%"
      scripts:
        - name: "%SCRIPT%"
          template_path: "%SCRIPT_TEMPLATE%"
      self_service_description: "%SELF_SERVICE_DESCRIPTION%"
      self_service_icon: "%SELF_SERVICE_ICON%"
