Description: Uploads the erase-install pkg to the JSS, and creates a Self-Service Policy available to members of a Testing group. A run command is added to the policy which will erase the volume.
Identifier: com.github.grahampugh.recipes.jss.erase-install
ParentRecipe: com.github.grahampugh.recipes.pkg.erase-install
MinimumVersion: "2.3"

Input:
  NAME: Erase and Reinstall macOS
  CATEGORY: Administration
  EXTENSION_ATTRIBUTE: Boot Volume Type-ExtensionAttribute.xml
  GROUP_NAME: Erase and Reinstall macOS test users
  GROUP_TEMPLATE: Erase and Reinstall macOS-SmartGroupTemplate.xml
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: Erase and Reinstall macOS-PolicyTemplate.xml
  PROD_NAME: "%NAME%"
  RUN_COMMAND: /Library/Management/erase-install/erase-install.sh --erase
  SELF_SERVICE_DESCRIPTION: WARNING! This will completely erase the device and reinstall macOS to the latest version.
  SELF_SERVICE_ICON: erase-install.png
  SELF_SERVICE_INSTALL_BUTTON: ERASE!
  SELF_SERVICE_REINSTALL_BUTTON: ERASE!

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: JSS recipes are being removed from grahampugh-recipes. For examples of functional jamf recipes, see grahampugh/jss-recipes

  - Processor: JSSImporter
    Arguments:
      category: "%CATEGORY%"
      extension_attributes:
        - ext_attribute_path: "%EXTENSION_ATTRIBUTE%"
      groups:
        - name: "%GROUP_NAME%"
          smart: true
          template_path: "%GROUP_TEMPLATE%"
      pkg_path: "%pkg_path%"
      policy_category: "%POLICY_CATEGORY%"
      policy_template: "%POLICY_TEMPLATE%"
      prod_name: "%NAME%"
      self_service_description: "%SELF_SERVICE_DESCRIPTION%"
      self_service_icon: "%SELF_SERVICE_ICON%"
      version: "%version%"
