Description: Downloads the latest Unison release and copies it to the recipe cache root. Then, uploads to the Jamf Pro Server.
Identifier: com.github.grahampugh.recipes.jss.unison
ParentRecipe: com.github.grahampugh.recipes.pkg.unison
MinimumVersion: "2.3"

Input:
  NAME: Unison
  CATEGORY: Tools & Accessories
  GROUP_NAME: "%NAME%-update-smart"
  GROUP_TEMPLATE: SmartGroup-update-smart-regex.xml
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: Policy-install-latest.xml
  SELF_SERVICE_DESCRIPTION: Unison is a file-synchronization tool for OSX, Unix, and Windows. It allows two replicas of a collection of files and directories to be stored on different hosts (or different disks on the same host), modified separately, and then brought up to date by propagating the changes in each replica to the other.
  SELF_SERVICE_ICON: Unison.png
  TESTING_GROUP_NAME: Testing

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: JSS recipes are being removed from grahampugh-recipes. For examples of functional jamf recipes, see grahampugh/jss-recipes

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: JSSImporter
    Arguments:
      category: "%CATEGORY%"
      groups:
        - name: "%GROUP_NAME%"
          smart: true
          template_path: "%GROUP_TEMPLATE%"
      policy_category: "%POLICY_CATEGORY%"
      policy_template: "%POLICY_TEMPLATE%"
      prod_name: "%NAME%"
      self_service_description: "%SELF_SERVICE_DESCRIPTION%"
      self_service_icon: "%SELF_SERVICE_ICON%"
