Description: Downloads and package the latest LibreOffice with the right language. Set RELEASE to either "fresh" or "still"
Identifier: com.github.grahampugh.recipes.pkg.LibreOfficeLangPack
ParentRecipe: com.github.grahampugh.recipes.download.LibreOfficeLangPack
MinimumVersion: 1.0.0

Input:
  NAME: LibreOffice
  LANGUAGE_CODE: de
  RELEASE: still
  TYPE: mac-x86_64

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname_app%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/LibreOffice.app'
    source_path: '%pathname_app%/LibreOffice.app'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%'
    source_path: '%pathname%/LibreOffice Language Pack.app/Contents/tarball.tar.bz2'

- Processor: Unarchiver
  Arguments:
    archive_path: '%RECIPE_CACHE_DIR%/tarball.tar.bz2'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%.app'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: org.libreoffice.langpack-%LANGUAGE_CODE%
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
    pkgname: '%NAME%_%LANGUAGE_CODE%-%version%'
