<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe Creative Cloud Cleaner and makes a pkg of it then uploads it to the JSS. the postinstall script runs the cleaner, which removes all Adobe CC apps from a client. The app is also moved to the Utilities folder so that it can be used subsequently, but is not obvious to the user.</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.jss-triggeronly.AdobeCCCleaner</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Triggered Installers</string>
		<key>NAME</key>
		<string>Adobe Creative Cloud Cleaner Tool</string>
		<key>POLICY_CATEGORY</key>
		<string>Untested</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate-triggeronly.xml</string>
		<key>POSTINSTALL_SCRIPT</key>
		<string>Adobe CC Cleaner-postinstall.sh</string>
		<key>POSTINSTALL_SCRIPT_TEMPLATE</key>
		<string>Adobe CC Cleaner-postinstall-ScriptTemplate.xml</string>
		<key>PROD_NAME</key>
		<string>%NAME%</string>
		<key>TRIGGER_NAME</key>
		<string>Run-AdobeCCCleaner</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.blackthroat.pkg.AdobeCreativeCloudCleanerTool</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
				<key>scripts</key>
				<array>
					<dict>
						<key>name</key>
						<string>%POSTINSTALL_SCRIPT%</string>
						<key>template_path</key>
						<string>%POSTINSTALL_SCRIPT_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
