<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates all production policies for Carbon Copy Cloner</string>
	<key>Identifier</key>
	<string>com.github.grahampugh.recipes.jss.prod.CarbonCopyCloner</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Carbon Copy Cloner</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>com.github.grahampugh.recipes.jss-prod.prod-self-service</string>
</dict>
</plist>
