Description: >
  Displays a health and inventory snapshot of a Jamf Pro instance, including
  enrollment counts, alerts, and security posture. Makes ~37 parallel API
  calls to build the overview dashboard.
Identifier: com.github.grahampugh.recipes.jamfclirunner.JamfProOverview
MinimumVersion: "2.3"

Input:
  PROFILE: my-jamf-pro-instance
  OUTPUT_FORMAT: json

Process:
  - Processor: com.github.grahampugh.recipes.JamfCLIRunner/JamfCLIRunner
    Arguments:
      type: pro
      endpoint: overview
      profile: "%PROFILE%"
      output: "%OUTPUT_FORMAT%"
