Comment: Recipe automatically generated from com.github.jss-recipes.jss.CarbonCopyCloner by JamfRecipeMaker
Identifier: com.github.autopkg.grahampugh-recipes.jamfcli.JamfProDeployPackageCarbonCopyCloner
ParentRecipe: com.github.keeleysam.recipes.pkg.CarbonCopyCloner
MinimumVersion: "2.3"

Input:
  NAME: Carbon Copy Cloner
  POLICY_NAME: "Install Latest %NAME%"
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  TESTING_GROUP_NAME: Testing
  SELF_SERVICE_DESCRIPTION: Powerful disk cloning and backup utility.
  UPDATE_PREDICATE: pkg_uploaded == False
  SELF_SERVICE_DISPLAY_NAME: "Install Latest %NAME%"
  GROUP_NAME: Carbon Copy Cloner-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  SELF_SERVICE_ICON: "%NAME%.png"

Process:
  - Processor: com.github.grahampugh.recipes.JamfCLIRunner/JamfCLIRunner
    Arguments:
      type: pro
      endpoint: categories
      action: apply
      profile: "%PROFILE%"
      confirm: "true"
      data:
        name: Utility
        priority: 10
      output_vars:
        pkg_category_id: id
        pkg_category_name: name

  - Processor: com.github.grahampugh.recipes.JamfCLIRunner/JamfCLIRunner
    Arguments:
      type: pro
      endpoint: categories
      action: apply
      confirm: "true"
      data:
        name: Testing
        priority: 10
      output_vars:
        policy_category_id: id
        policy_category_name: name

  - Processor: com.github.grahampugh.recipes.JamfCLIRunner/JamfCLIRunner
    Arguments:
      type: pro
      endpoint: packages
      action: apply
      from_file: JamfPro-Package.json
      confirm: "true"
      name: "%PKG_NAME%"
      pkg_info: Package uploaded using JamfCLIRunner
      pkg_priority: "10"
      pkg_notes: Package uploaded using JamfCLIRunner

  - Processor: StopProcessingIf
    Arguments:
      predicate: "FALSEPREDICATE"

  # - Processor: com.github.grahampugh.recipes.JamfCLIRunner/JamfCLIRunner
  #   Arguments:
  #     computergroup_name: "%GROUP_NAME%"
  #     computergroup_template: "%GROUP_TEMPLATE%"
  #     replace_group: True

  # - Processor: com.github.grahampugh.recipes.JamfCLIRunner/JamfCLIRunner
  #   Arguments:
  #     replace_policy: True
  #     policy_template: "%POLICY_TEMPLATE%"
  #     icon: "%SELF_SERVICE_ICON%"
  #     policy_name: "%POLICY_NAME%"
