Description: >
  Displays the health and configuration dashboard for a Jamf Protect tenant.
  Makes ~14 parallel API calls to build the overview.
Identifier: com.github.grahampugh.recipes.jamfclirunner.JamfProtectOverview
MinimumVersion: "2.3"

Input:
  PROFILE: my-jamf-protect-instance
  OUTPUT_FORMAT: json

Process:
  - Processor: com.github.grahampugh.recipes.JamfCLIRunner/JamfCLIRunner
    Arguments:
      type: protect
      endpoint: overview
      profile: "%PROFILE%"
      output: "%OUTPUT_FORMAT%"
      out_file: "%RECIPE_CACHE_DIR%/overview.%OUTPUT_FORMAT%"
