Description: Lists all computer groups from a Jamf Pro instance using jamf-cli.
Identifier: com.github.grahampugh.recipes.jamfclirunner.JamfProListComputerGroups
MinimumVersion: "2.3"

Input:
  PROFILE: my-jamf-pro-instance
  OUTPUT_FORMAT: json

Process:
  - Processor: com.github.grahampugh.recipes.JamfCLIRunner/JamfCLIRunner
    Arguments:
      type: pro
      endpoint: computer-groups
      action: list
      profile: "%PROFILE%"
      output: "%OUTPUT_FORMAT%"
      out_file: "%RECIPE_CACHE_DIR%/computer_groups.%OUTPUT_FORMAT%"
