Description: Installs the latest version of Visual Studio Code.
Identifier: com.github.grahampugh.install.VisualStudioCode
ParentRecipe: com.github.valdore86.download.visualstudiocode
MinimumVersion: "2.3"

Input:
  NAME: Visual Studio Code

Process:
  - Processor: DmgCreator
    Arguments:
      dmg_path: "%RECIPE_CACHE_DIR%/VisualStudioCode.dmg"
      dmg_root: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: InstallFromDMG
    Arguments:
      dmg_path: "%dmg_path%"
      items_to_copy:
        - destination_path: /Applications
          source_item: Visual Studio Code.app
